{"schema":{"fields":[{"name":"index","type":"integer"},{"name":"url","type":"string"},{"name":"error","type":"boolean"},{"name":"error_msg","type":"string"},{"name":"overview","type":"string"},{"name":"qualifications","type":"string"},{"name":"responsibilities","type":"string"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":0,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1701465\/Software-Engineer","error":false,"error_msg":"","overview":"Overview\nMicrosoft is built on trust, and Azure is dedicated to becoming the most trusted cloud service for its customers. As Azure expands its services, certifications, and regions for its global customers, there is a growing need for increased support to uphold customer promises. The Azure Core Trusted Platform team is committed to enabling product teams to deliver capabilities that align with customer commitments and provide transparency. If you're a Software Engineer who is passionate about building cloud services and eager to learn new technologies, with the determination to solve complex technical problems, then this position is perfect for you.\n\nJoin our diverse and welcoming team that is dedicated to building privacy, security and compliance engineering solutions for the Azure cloud. We use cutting-edge Azure service, data, and Machine Learning [ML] technologies to create products that are widely used across Microsoft teams. Our team values inclusiveness and diverse ideas, and we prioritize empathy, trust, and ownership to drive our team culture and deliver products quickly and iteratively. You'll work in a fast-paced environment, tackling problems that require creativity and collaboration to achieve meaningful business outcomes. We continuously strive for world-class engineering and operational excellence and encourage you to influence our designs and architectural roadmap and drive specific goals around scalability and availability. Join us and help make Azure the most trusted cloud platform!\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond\n ","qualifications":"Qualifications\nRequired Qualifications: \nBachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience\nOther Requirements:\nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check\nThis position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter\nAdditional \/ Preferred Qualifications: \nBachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience\nSoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n Microsoft will accept applications for the role until March 26, 2024.\n\n #Azurecorejobs #AzureCoreTrustedPlatform","responsibilities":"Responsibilities\nDesign and implement cloud engineering systems and platforms\nCollaborate with developers and program managers throughout the development lifecycle (sprint planning, scrums, code reviews, and live site management, etc\nEmbody our Culture and Values"},{"index":1,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1702440\/Software-Engineer","error":false,"error_msg":"","overview":"Overview\nCommerce + Ecosystems (within Cloud + AI group) is developing Microsoft’s large scale and business-critical backbone services to empower e-commerce for all of Microsoft’s key businesses: Azure, Office 365, Xbox, Microsoft Online Store, Microsoft Ads, and a lot more. If you play Xbox games with in-app purchase, buy cloud service on Azure, subscribe Office 365 for personal or business use, pay for advertising on Bing.com, then you are using our commerce platform to transact.  \n \nAs a Software Engineer in the Commerce + Ecosystems team, you will focus on delivering high quality customer and partner experiences and exceptional business outcomes through Microsoft’s commerce systems, today and in the digitally transformed future.  \n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n By applying to this U.S. based position, relocation does not apply\/is not provided for the role.","qualifications":"Qualifications\nRequired Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience. \n Other Requirements:\nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter.\n Preferred qualifications:    \nExperience with public cloud services, such as Azure, AWS, GCP    \nExperience with large scale eCommerce Risk Management    \nExperience with Microsoft’s Power Platform and Dynamics 365 development \nExperience with data analytics, data modeling and AI fundamentals  \nExperience in software development (or similar) for cloud based services with UI and backend \nExperience working across organizations leading integration and solutions in a complex environment  \nExperience in leading software projects from ideation to delivery, across multiple teams and technology areas   \nExperience in architecting and developing robust and extensible solutions   \nExperience in working with globally distributed teams \n  Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here:\nhttps:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n Microsoft will accept applications for the role until March 26, 2024.\n ","responsibilities":"Responsibilities\nDesign, innovate, automate, and sustain scalable end-to-end operational solutions. \nCollaborate with business teams to help our internal partners sell products and services, and our customers buy them, in a secure, frictionless manner. \nBuild and deliver impactful services and tools that are compliant by design, flexible, configurable with fast feedback loops. \nImplement architecture solutions that are resilient and durable.\nCommunicates clearly, accurately, and timely in written and spoken forms.\nExecute with operational excellence.\nProactively seeks new knowledge and has the willingness to learn, share, and improve. \nEmbody our culture and values"},{"index":2,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1693831\/Software-Engineer","error":false,"error_msg":"","overview":"Overview\nAre you passionate about improving the productivity of engineers in your organization and across Microsoft? Do you want to work on cutting edge web and cloud technologies to deliver world class services and user experiences? Do you want to be part of the team that builds end to end systems and services that helps improve engineers experience and productivity while enabling them to keep the quality of their code high? Do you want to be part of a diverse, fast paced and highly technical team that takes pride in delivering value to our customers on time with quality in an agile cadence? We may have your next position—a chance to make a difference for you, and every Microsoft engineer. \n Our team is part of the Azure & Windows Engineering System group. We are building highly scalable cloud solutions for our developer community in Azure and Windows of about ~30k engineers. The projects consist of Web development (react\/redux\/epic), Data stores (cosmos db, sql, Kusto etc), Web Services (.NET & NodeJS), Azure Micro services and Azure DevOps extensions. We are a super agile team, we use Git, VSCode, Azure, Azure DevOps in our day to day job. We have a consistent channel to our customers using feedback loop so we are iterative in our approach. Our leadership have made creating the best engineering system in the world a top priority as we look to make engineering a part of the competitive edge in winning the marketplace.\nOur team prides in creating diverse and inclusive culture. We move fast and at the same time keep a high bar for quality. We have broad influence, partnering with teams within the organization as well as across organizations within the company.","qualifications":"Qualifications\nRequired Qualifications:\nBachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\no OR equivalent experience.\nExperience working on web UX\/backend API applications \nTechnical engineering experience with coding in at least one of the following languages - C# \/ Java \/ JavaScript \/ Typescript\nOther Requirements:\n  Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter.\n Preferred Qualifications\nBachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\no OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\no OR equivalent experience.\n1+ years of experience delivering commercial software\nPassionate about moving into a Full stack Engineer role eventually\nSolid technical design, problem solving, debugging and communication skills.\nDemonstrated experience in shipping high quality products and services.\nBS\/MS in Computer Science or equivalent industry experience.\nWrites high quality code and driven to excellence in engineering processes.\nIs a self-starter and likes to learn every day not fearing to experiment and learn from it.\nPassionate about developers who are our primary customers and their experience with our services.\nSoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n #AEPJobs\n ","responsibilities":"Responsibilities\nAs a member on the team you will participate in all stages of our engineering lifecycle such as designing, coding, testing, deploying and supporting features that enable our mission critical services. We are passionate about having a culture of learning fast and constantly iterating based on feedback from customers and partners helping us move towards success.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n Embody our Culture and Values"},{"index":3,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1702175\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nMicrosoft is a company where passionate innovators come to collaborate, envision what can be and take their careers further. This is a world of more possibilities, more innovation, more openness, and the sky is the limit thinking in a cloud-enabled world.\n\nMicrosoft’s Azure Data engineering team is leading the transformation of analytics in the world of data with products like databases, data integration, big data analytics, messaging & real-time analytics, and business intelligence. The products our portfolio include are Microsoft Fabric, Azure SQL Database (DB), Azure Cosmos DB, Azure PostgreSQL, Azure Data Factory, Azure Synapse Analytics, Azure Service Bus, Azure Event Grid, and Power BI. Our mission is to build the data platform for the age of AI, powering a new class of data-first applications and driving a data culture.\n Within Azure Data, the databases team builds and maintains Microsoft's operational Database systems. We store and manage data in a structured way to enable multitude of applications across various industries. We are on a journey to enable developer friendly, mission-critical, AI enabled operational Databases across relational, non-relational and Open Source Software (OSS) offerings.\n The Azure Data SQL Core Team is looking for a Software Engineer II with a passion for technology, performance and helping customers succeed on our platform by building the next set of industry-leading features and capabilities. SQL Core team works on key Azure SQL Database operating system capabilities (scheduling, memory management, locking, synchronization ...) with a focus on driving product performance and reducing Total Cost of Ownership (TCO). We seek engineers who have experience in operating systems, hardware architectures (Intel, AMD, ARM), persistent memory technologies, performance and scalability on Windows and Linux. Engineers in SQL Core team will define and implement the next set of technologies, build new solutions and enable a new set of experiences for enterprise and cloud customers.\n We do not just value differences or different perspectives. We seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better served.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.","qualifications":"Qualifications\nRequired\/Minimum Qualifications\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nOther Requirements\nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\nThis position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter.\nPreferred\/Additional Qualifications\n2+ years of experience designing and developing production quality software using C\/C++; proven experience in improving product performance.\nExtensive and specialized knowledge in one or more of the following areas: Database\/Operating System(OS) internals, Big Data technologies, Hardware knowledge (CPU\/System\/Networking\/Storage..), and Cloud related technologies.\n2+ years of experience related to Performance Engineering skills covering design\/development\/usage of performance workloads\/test-suites\/Tools to measure, analyze and root cause performance and scalability issues in the product.\nExperience in both Windows and Linux system administration fundamentals\nMethodical problem-solving, interpersonal, and communication skills \n Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year. \n   Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay \n  #azdat\n#azuredata","responsibilities":"Responsibilities\nIdentifying and driving prototype projects for quick evaluation of design ideas\nContributing to current and future product improvements around performance (perf\/scale\/SLA)\nLooking into emerging and upcoming Azure Hardware(HW) SKUs and technologies, exploring new ideas to drive product improvements (hardware\/software\/config\/COGS). Also includes modeling, analysis & benchmarks.\nStrengthening the engineering process to ensure cloud deployments (software & hardware) are done in the most efficient way and meet the targeted perf\/scale\/Service Level Agreement (SLA) goals.\nIdentifying improvements in supportability and customer self-diagnostics that enable live monitoring with focus on identifying\/addressing performance related issues.\nSpend days collaborating with, teaching, and learning from a diverse set of world class engineers.\nObsessed with customers, making data-driven decisions, and using telemetry collected from customers and production systems.\nEmbody our culture and values"},{"index":4,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1674925\/Software-Engineer-2","error":false,"error_msg":"","overview":"Overview\nAre you excited about cybersecurity? How about using Machine Learning (ML) and big data to catch hackers? Then Microsoft365 Core Security could be the team for you! We’re looking for Software Engineer 2 to build data platforms that protect Microsoft services from cyberattacks. We value diversity on multiple fronts and believe in deep collaboration to bring the best technological solutions to hard problems.\nWe are a cross-disciplinary team of engineers with wide-ranging expertise in large-scale software systems, cybersecurity, big data, and machine learning, and we delight in solving the ever-increasing scale and complexity challenges of processing billions of events and terabytes of data generated every day by Microsoft services to catch attackers.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired Qulifications: \nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n Other Qualifications: \nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter\nPreferred Qualifications:\nExperience working with an object-oriented programming language such as C#, Java or Python\nEffective software design and problem-solving skills\nExperience with modern software service engineering practices such as Testing in Production, Live Monitoring, Data Driven Engineering\nRapid prototyping and iteration skills\nExperience acting in tech lead roles on projects\nExperience with Spark or other distributed computing platforms\nExperience with productionizing ML models\nA passion for data science and machine learning\nCloud and services experience, with Azure cloud experience highly desirable\nBackground in cybersecurity\n Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay \n Microsoft will accept applications and processes offers for these roles on an ongoing basis.\n  #DSR #MSFTSecurity #dataengineering #bigdata #ml","responsibilities":"Responsibilities\nWrite well-designed code with an emphasis on quality, maintainability, scalability, and performance.\nExecute the dev-ops approach to software delivery by designing, coding, testing, deploying, and operating components of the Microsoft 365 security monitoring system.\nLead projects with multiple engineers, in collaboration with stakeholders from multiple teams."},{"index":5,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1665504\/Software-Engineer-II---AI-Compilers","error":false,"error_msg":"","overview":"Overview\nThe AI Frameworks team at Microsoft develops the AI software used to train and deploy the world’s most advanced AI models. We build state-of-the-art AI compilers and design new AI programming abstractions for Microsoft’s next-generation supercomputers and the new Maia-100 AI accelerator. Our interdisciplinary team operates at the intersection of compiler engineering, programming language design, algorithmic innovation, AI, and high-performance computing. Our culture is highly collaborative and we regularly partner with researchers, hardware architects, platform engineers, and other software groups across the company. We also enthusiastically participate in the open-source community to build AI software that everyone can share and enjoy.  \n We are seeking a talented and collaborative Software Engineer II to join our AI Compiler effort. Don’t miss this unique opportunity to join a dynamic team, working on cutting-edge technology that has a direct impact on every Microsoft business.  \n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. ","qualifications":"Qualifications\nRequired Qualifications: \nBachelor's Degree in Computer Science, or related technical discipline AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, or Python \nOR equivalent experience. \n1+ years experience with C\/C++ \n Preferred Qualifications: \n1+ years experience with Python \nExperience or interest in building compilers, compiler optimizations, or using compiler frameworks like LLVM or MLIR \nExperience implementing and optimizing AI workloads or other compute-intensive workloads. \nTechnical background and solid foundation in software engineering principles. \nExperience using or developing Machine Learning training or inference software \nContinued intellectual curiosity and an interest in learning new technologies. \nCross-team collaboration skills and communication skills \nA commitment to a diverse and inclusive workgroup culture \n Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n Microsoft accepts applications and processes offers for these roles on an ongoing basis.\n  #aifx \n#AIPLATFORM#\n#AIPLATREF#","responsibilities":"Responsibilities\nDesign and develop AI software in C\/C++, Python, and other languages. \nImplementing innovative new compiler features and optimization passes \nDeveloping code generation techniques for novel hardware platforms \nOptimizing AI workloads \nDesigning new programming abstractions for AI \nCollaborating broadly across multiple disciplines from hardware architects to ML developers. \nIdentify requirements, scope solutions, estimate work, schedule deliverables. \nHelp establish and drive the adoption of outstanding coding standards and patterns and help enhance our inclusive engineering culture. \nEmbody our Culture and Values"},{"index":6,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1702186\/Software-Engineer-I","error":false,"error_msg":"","overview":"Overview\nMicrosoft is a company where passionate innovators come to collaborate, envision what can be and take their careers further. This is a world of more possibilities, more innovation, more openness, and the sky is the limit thinking in a cloud-enabled world.\n\nMicrosoft’s Azure Data engineering team is leading the transformation of analytics in the world of data with products like databases, data integration, big data analytics, messaging & real-time analytics, and business intelligence. The products in our portfolio include Microsoft Fabric, Azure SQL DB, Azure Cosmos DB, Azure PostgreSQL, Azure Data Factory, Azure Synapse Analytics, Azure Service Bus, Azure Event Grid, and Power BI. Our mission is to build the data platform for the age of AI, powering a new class of data-first applications and driving a data culture.\n Within Azure Data, the big data analytics team provides a range of products that enable data engineers and data scientists to extract intelligence from all data – structured, semi-structured, and unstructured. We are in the process of integrating our disparate products into Azure Synapse Analytics with a set of experiences that are meant to simplify and accelerate time to value.\n\nWe are looking for a Software Engineer I for the development of core components of the Cloud Data Warehouse that powers SQL analytics in Azure compute. You will work in areas related to query optimization, transactional storage and distributed query processing to build an elastic and scalable cloud DW to enable Tier1 enterprise workloads in Azure Data Lake. We are looking for passionate people with the ability to design components carefully, properly handle errors, write clean and well-factored code with good tests and good maintainability.   \n We do not just value differences or different perspectives. We seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better served.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.","qualifications":"Qualifications\nRequired\/Minimum Qualifications\nBachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n Other Requirements\nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\nThis position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter.\nPreferred\/Additional Qualifications \nBachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\no OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\no OR equivalent experience.\nExperience in developing Cloud online services or experience using cloud online services.\nExperience in Distributed Big Data systems.\nSoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  \n\n#AZDAT\n#AZUREDATA","responsibilities":"Responsibilities\nFeature Development. Contribute to the development of features, starting from the initial stages like prototype creation to ensuring widespread customer adoption. Work collaboratively within the development lifecycle, gaining hands-on experience in turning high-level feature requirements into tangible solutions.\nDocumentation and Conceptualization. Generate software specifications and contribute to proof-of-concepts for various features. Contribute to the creation of prototype solutions, gaining exposure to the conceptualization process.\nCollaborative Teamwork. Collaborate closely with team members to overcome challenges and ensure a smooth workflow. Share knowledge and learnings with team members, fostering a collaborative and supportive work environment.\nData-Driven Approach. Utilize data and telemetry tools to enhance feature development. Propose improvements to existing products based on data analysis, contributing to the overall enhancement of our cloud data warehousing solutions.\nEmbody our culture and values "},{"index":7,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1698032\/Software-Engineer-2","error":false,"error_msg":"","overview":"Overview\nWe are building the Intelligent Conversation and Communications Cloud (IC3). We power Microsoft’s first-party real-time conversation products, notably Skype and Teams with many millions of users, by providing reliable and high-quality audio and video calling, meetings, and chat services that work every time, from anywhere, on any device. And we expose our core capabilities to third-party partners, with which they can bring conversations to life in their own products. With IC3, we will enable customers to do more by making conversations on our platform more intelligent, surfacing useful information in real-time and taking actions on the customers’ behalf during the conversation. And, we will learn from each conversation. Every call, meeting, or chat will make the next one better.\n    Building and running services at scale for Microsoft 365 for hundreds of million consumer and enterprise users is very challenging, but it is a lot of fun and rewarding. We are hiring a Software Engineer 2 to help us do just that to power and deliver on IC3's mission.  This opportunity will allow you to make a broad positive impact across many critical IC3 domains such as chat, audio\/video calling, meetings, service and data engineering, and service management.\n    We want you because you have an insatiable passion for technology, your constant intellectual curiosity and willingness to learn, your ability to communicate well in a team environment, your desire to make our team better with your contributions and of course your ability to deliver the right results at the right time.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n Embody our Culture and Values\n ","qualifications":"Qualifications\nRequired\/Minimum Qualifications\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n Additional or Preferred Qualifications\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nExperience in building production-grade ML pipelines. Domain specific experience in Audio Digital Signal Processing.\n\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year. \n Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n   #M365Core","responsibilities":"Responsibilities\nAs a Software Engineer 2, you will be responsible for:\nDesign implementation and evaluation of Audio DSP (Digital Signal Processing) related machine learning algorithms for real-time communications\nDesign and develop ML pipelines involving data cleaning, feature engineering, model training, and evaluation\nWork across the product lifecycle from prototyping to shipping production-grade code optimized for performance and memory and updating the deployed models based on A\/B testing\nRemain up to date with latest advancements, trends and research and contribute towards our IP portfolio\nCollaborate with other engineering and research teams across the company"},{"index":8,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1698336\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nThe Virtualization Core Platform team is looking for a software engineer to work on the Hyper-V storage virtualization platform and help drive the development of the next generation of our stack.\n In Core OS (Operating System), we are responsible for the Operating Systems that power Azure, Microsoft's Linux OS, the platforms for Windows Client and Xbox, and our Windows Server ecosystem – through all of these, we support every one of our cloud businesses and billions of customers around the world. In this era of ubiquitous computing, systems software excellence has never been more important for Microsoft. High quality, high-efficiency operating systems and platform components underpin everything we do as a company, from making our systems more reliable for our customers, to increasing our competitiveness by reducing COGS (Cost of Goods Sold), to delivering new features and capabilities to delight customers – that’s all us! \n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond","qualifications":"Qualifications\nRequired\/Minimum Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++ or RUST.\nOR equivalent experience\n1+ year experience with multithreaded programming, operating systems, device drivers and\/or firmware\n Other Requirements:\nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter.\n Additional or Preferred Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python \nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python \nOR equivalent experience. \nProfessional or hobby experience working on any type of device virtualization is also desirable.\n Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay","responsibilities":"Responsibilities\nResponsibilities  \n Collaborate with a dynamic team of engineers, including mentoring more junior engineers in the workgroup. \nLearn and share ideas continuously. \nDrive for quality in everything you do and continuously improve the quality of the systems on which you work. \nCollaborate across team boundaries to define and drive team charter and vision. \nProvide technical input across the Windows Core and Azure teams.\nDesign and implement new virtualization related features for Hyper-V and Windows. "},{"index":9,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1699995\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nViva Goals is a goals management SaaS solution that enables teams and organizations to define and manage their goals easily and effectively. As part of the Microsoft Viva suite, Viva Goals integrates into employee experiences, empowering teams and individuals to manage their goals from anywhere, and helps individuals foster a culture of accountability, transparency, and alignment, ensuring that everyone is working towards the same objectives. \n We are currently on a mission to reimagine and simplify the process of goals management for teams\/individuals using the power of data (from other work-related systems) and AI. We are in midst of building a brand new V2 version of the product from the ground up using the latest and greatest technologies. We are seeking successful Software Engineers who will help us on this journey of building a large-scale enterprise-ready product. \n As a Software Engineer II in the service core team, you will be working on building foundational services that will help scale Viva Goals to enterprise users. This includes but is not limited to building storage, caching, job framework and streaming platform which will act as the backbone of Viva Goals service. You will partner with teams\/engineers to ensure availability, reliability, security and performance of foundational services to meet customer SLO’s.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nPreferred Qualifications:\nBachelor's Degree in Computer Science OR related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n ","responsibilities":"Responsibilities\nWorks with appropriate stakeholders to determine user requirements for a set of features.\nContributes to the identification of dependencies, and the development of design documents for a product area with little oversight.\nCreates and implements code for a product, service, or feature, reusing code as applicable.\nContributes to efforts to break down larger work items into smaller work items and provides estimation.\nActs as a Designated Responsible Individual (DRI) working on-call to monitor system\/product feature\/service for degradation, downtime, or interruptions and gains approval to restore system\/product\/service for simple problems.\nRemains current in skills by investing time and effort into staying abreast of current developments that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale."},{"index":10,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1695997\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nAzure Storage team is chartered with building, managing, and running the persistent cloud storage for Microsoft Azure cloud. We are one of the foundational services in the Azure Cloud and host data from some of the largest companies in the world plus all of Microsoft’s largest online businesses including Xbox, Teams, and Bing.\n\nAzure Cloud has one of the highest number of data centers amongst all the cloud providers. Azure Storage, which is a massively scalable, highly distributed, ubiquitously accessible storage system, is designed to scale out and serve the entire world with hundreds of thousands of devices in our data centers across the world. This role provides a unique opportunity to work on both software and hardware optimizations that will help drive the scale of Azure Storage to the next level. We are looking for a Software Engineer-II who is passionate about building and optimizing a world class distributed file system. If you love large scale distributed systems, love to work on new projects where you can define the work, scope, direction, and architect new solutions to make an impact on a massive product like Azure storage, this could be position for you! You will have an opportunity to make high impact changes on a daily basis as you build a hyperscale storage system that may indirectly or directly be used daily by of your friends and family.\n\nIn the Software Engineer II role you will be working on the cutting edge of distributed systems and high scale storage on some of the largest storage systems on the planet, solving the interesting challenges that come with high scale, rapid growth, and continued innovations. You would be joining a talented, highly collaborative team, with responsibility for engineering the lowest most fundamental layers of the Azure storage service. The role brings exposure to cutting edge storage, memory, networking, and distributed system technologies, with broad opportunity to influence both the business and the industry. The team is responsible for the meta-data data service as well as storing the data across storage servers while ensuring high availability, reliability, durability, and cost efficiencies.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n1+ years of experience in software engineering practices, coding and solid foundation in data structures and algorithms, with problem solving, debugging and analytical skills.\n Other Requirements:\nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire\/transfer and every two years thereafter.\n Preferred Qualifications\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nExperience in building and operating services at scale.\nExperience in Storage or File-Systems, Networking, Distributed Systems, Operating Systems and\/or Applications at scale is preferred but not required.\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  #azurecorejobs","responsibilities":"Responsibilities\nWorks with appropriate stakeholders to determine user requirements for a set of features.\nContributes to the design, and creates and implements code for a product, service, or feature, reusing code as applicable.\nContributes to efforts to break down larger work items into smaller work items and provides estimation.\nActs as a Designated Responsible Individual (DRI) working on-call to monitor system\/product feature\/service for degradation, downtime, or interruptions and gains approval to restore system\/product\/service for simple problems.\nContributes to improving availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale."},{"index":11,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1678333\/Software-Engineer","error":false,"error_msg":"","overview":"Overview\nThe Identity and Network Access team is part of the Security organization in Microsoft and is responsible for bringing networking, identity, and security together. In these times, where working from anywhere has never been more important, it is our set of services that enables people around the world to stay productive every day, while still meeting companies’ security and compliance needs. Our cloud services are built to solve these challenges for our customers in a seamless and integrated stack as we constantly push ourselves to stay at the cutting edge of the industry.    \n We're beyond excited to share we have just announced a brand new product: a fusion of networking, identity, and security solutions.  \n Introducing Microsoft Entra Internet Access -- which comes to protect web, SaaS applications and Microsoft 365 applications, setting rules and policies to control and avoid outside threats. Microsoft Entra Private Access protects access to private networks of the organization and gives access to the relevant employees from any network or device. By granting organizations the authority to set precise policies for specific applications, we substantially diminish the risk of unauthorized access to valuable organizational resources.   \n Read more here: Microsoft Entra Expands into Security Service Edge with Two New Offerings\n We’re looking for a Software Engineer to help us build the next set of capabilities in the Entra Private Access solution focusing on managing their private network resources. \nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.  \n In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day. ","qualifications":"Qualifications\nRequired\/Minimum Qualifications:\nBachelor's Degree in Computer Science, or related technical discipline with experience coding in languages including, but not limited to, C, C++, C#, Golang, Java, JavaScript, or Python\nOR equivalent experience.\nOther Requirements:\n Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire\/transfer and every two years thereafter.\nAdditional or Preferred Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field with experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nFamiliarity with core networking protocols and technologies.\nExperience with Unix\/Linux based operating systems and open source contributions.\n Software Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.\n Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  #IdentityJobs \n#MSFTSecurity ","responsibilities":"Responsibilities\nWork with the Product and Engineering team members to design and develop large scale distributed software services and solutions.   \nAdhere to and drive modern software engineering practices through design reviews.   \nSystem design through well-defined interfaces across multiple components, code reviews, leveraging data\/telemetry to make decisions.   \nDevelop “best-in-class” engineering for our services by ensuring that the services and the components are well-defined and modularized, secure, reliable, diagnosable, actively monitored and reusable.   \nImprove test coverage for services, organize and implement integration tests, and resolve problem areas.   \nConsider testability, portability\/monitoring, reliability, and maintainability, and understand when code is ready to be shared and delivered.   \nGain a working understanding of Microsoft businesses and collaborate with mentors and leaders to contribute to cohesive, end-to-end experiences for our users.   \nFocus on customer\/partner needs through a data driven approach.   \nTroubleshoot and optimize automation, reliability, and monitoring for Live Site. "},{"index":12,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1700140\/Software-Engineer-II--Viva-Horizontals","error":false,"error_msg":"","overview":"Overview\nViva Horizontals is a shared platform and core services team under Viva Employee Experience Organization (EXP) and are a catalyst for suite growth. The team creates foundational services in core suite-wide areas like access management, innovates on suite-level platforms like Viva Skills and are responsible for pioneering Viva’s presence on M365 Copilot. Viva Horizontals work on pivotal infrastructure and platform services that have a Viva-wide influence and value.\n Software Engineer II - Viva Horizontals\nThe Viva Horizontals team is looking to hire a Software Engineer II to lead Viva Skills Services and APIs through the exciting journey of skills based experiences across Viva. The scope of work would be to build and maintain a scalable, highly available skills service across the Viva ecosystem. Following the operational and engineering excellence best practices.\n In this role you will be responsible for architecture, systems design and operations at scale for Viva Skills platform and will work alongside rest of the partner teams in Viva. We are a truly distributed team and have mechanisms in place to make individuals successful irrespective of their location and time zone differences. We run as a start-up, encouraging team members to share a sense of “founder-ism.” Team members engage directly with customers, iterate rapidly, and focus on solving the needs of employees around the world. Our culture is inclusive, casual, and motivated. Our team celebrates diverse backgrounds, and values passion for serving our customers. Our team has a keen sense of accountability and provides its members with opportunities for learning and career growth.\n Location: By applying to this U.S. based position, while remote work is possible, relocation does not apply\/is not provided for the role.\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.","qualifications":"Qualifications\nRequired\/Minimum Qualifications:\nBachelor's Degree in Computer Science, or related technical discipline AND 2+ years software development experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n               o OR equivalent experience.\n Preferred Qualifications:\nExperience architecting and developing robust and extensible solutions at enterprise scale\nExperience working with distributed systems\/Microservices architectures\nDemonstrated experience in design, coding, rapid prototyping, debugging, and problem-solving\nDemonstrated ability to work on cross-platform code\nDemonstrated experience communicating, collaborating and navigating ambiguity in a cross-group environment\nDemonstrated experience driving quality experience for customers\n\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n ","responsibilities":"Responsibilities\nResponsibilities:\nDefine, design, and deliver experiences from incubations stage to maturity with customer trust and user delight\nBe a role model for engineers in your team\nCreate clarity and take ownership of architecture decisions working with partners and customers\nDevelop and release new modules and horizontal features for the Viva Product Suite\nWork with our product and design team to implement intuitive and engaging user experiences.\nDefine and build systems and strategies to ensure quality, performance, simplicity, durability, scalability, and maintainability\nEmbody our culture and values"},{"index":13,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1698674\/Software-Engineer","error":false,"error_msg":"","overview":"Overview\nMicrosoft Entra sits within our Security, Compliance, Identity and Management Division and is at the heart of the day-to-day technology experience for billions of humans globally, playing a critical part in enabling everyone to achieve more. Our suite of products powers everything from Windows to Office, Azure to Xbox. Microsoft Entra is a dynamic and inclusive team which cares deeply about our customer experience and works to solve extraordinarily complex problems at extreme scale. If that sounds fun, we would love to meet you!  \n We are seeking a Software Engineer II to join our team and help solve some of our most complex problems. Our Routing team, of which you would be a part, is charged to increase availability of mission-critical services, building better software to serve over 1B humans globally. Are you passionate about distributed systems, and how to build and run them at extreme scale? Are you curious, a learner, someone who wants to grow in the craft of software engineering? \n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n  ","qualifications":"Qualifications\nRequired Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n2 years of experience writing high-performance, thread-safe code that allows for serving requests in sub-millisecond times.\n2 years of experience debugging difficult live site problems and building automation to run a high-scale service distributed system.\n Other Requirements:\n Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:  \nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter. \nPreferred Qualifications:\nHighly proficient computer networking skills with a depth of knowledge in newer protocols such as Hyper Text Transfer Protocol 2 and 3 (H2, H3) Transport Layer Security (TLS 1.3) and (Google Remote Procedure Call) gRPC. \nExperience in debugging difficult live site problems and building automation to run a high-scale service distributed system.\nExperience in various webserver frameworks such as nginx, Kestrel and Hyper Text Transfer Protocol (HTTP.Sys).\nTrack record as a hands-on engineer designing and delivering solutions to meet complex design and architectural challenges in a cloud services environment. \nDeep practical experience operating high-scale services in production environments. You’ve got experience and opinions on what great observability looks like, what safe deployments look like and whether to push code on Fridays. \nExcellent communications skills, comfortable presenting to large audiences and customers. \nPrior experience with performance analysis and optimization of web services and software. \nPrior experience building services which run on Microsoft Azure, Amazon Web Services, Google Cloud or Oracle Cloud Infrastructure. \nPrior experience working in the Identity and\/or Security domains. \n Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  #MicrosoftEntra \n#MSFTSecurity","responsibilities":"Responsibilities\nIn this role you will be responsible for:\nTraffic management.\nRuntime platform (K8s).\nLive site management.\nShipping critical software quickly and safely.\n Other\nEmbody our Culture and Values"},{"index":14,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1692207\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nAzure High Performance Computing and Artificial Intelligence Platform (HPC\/AI) group is the team behind Azure’s cloud offering that powers some of the most demanding and largest scale AI training and inference workloads in the industry. The virtual machine (VM) series that our team owns combine cutting edge GPUs and accelerators, as well as a state-of-the-art scale-out network infrastructure to enable these workloads. We collaborate with many Microsoft teams and our industry partners to design and bring up the underlying platform, and we build the software to expose this platform as an Azure service.\n\nWe are looking for a Software Engineer II who is committed to quality, wants the customer to succeed and gets things done. You will join a phenomenal team of hardworking engineers with deep experience in high performance computing, cloud infrastructure, operating systems, machine learning, and software engineering in general.\n\nAs a Software Engineer II in the Azure HPC\/AI team, you will play a critical role in designing and delivering the next generations of our platform by solving technical problems at all levels of the stack, contributing to our codebases to enable new features on our VMs, working on architectural proposals, and collaborating with our industry partners.\n\nThis position involves deep technical work that primarily focuses on hardware\/software (HW\/SW) interactions, device virtualization, and performance analysis of virtualized HPC\/AI workloads. Since our team is also responsible for the vertical integration of our VM offerings, you will also have the opportunity to work with the upper layers of the Azure infrastructure software.\n\nIt is an exciting time for the team as we are working on expanding the capacity and range of supported scenarios to fuel the next growth wave. This position offers a unique opportunity to have a huge impact on Microsoft’s AI infrastructure and AI initiatives.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired Qualifications: \nBachelor's Degree in Computer Science, or related technical discipline AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience\nOther Requirements:\nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire\/transfer and every two years thereafter.\n Additional or Preferred Requirements:\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  #azurecorejobs","responsibilities":"Responsibilities\nAnalyzes functionality, integration, and performance issues at various levels of the HW\/SW stack on current and future generations of AI training platforms.\nDesigns and codes solutions that improve functional correctness, stability and performance of AI training oriented VM offerings and related services. When appropriate drives internal partner teams or industry partners to implement such solutions.\nOptimizes, debugs, refactors, and reuses code to improve performance and maintainability, effectiveness, and return on investment (ROI). Applies metrics to drive the quality and stability of code, as well as appropriate coding patterns and best practices.\nHolds accountability as a Designated Responsible Individual (DRI), and collaborates with other engineers across products\/solutions, working as on-call to monitor system\/product\/service for degradation, downtime, or interruptions.\nDevelops a playbook for the team to resolve issues.\nMaintains communication with key partners across the Microsoft ecosystem of engineers.\nYour mission will be to help ensure Azure platform is consistent on performance, can scale on-demand, and engineered to withstand the unparalleled computing demand from the customer workloads. You will help build a test-driven engineering culture to reduce regressions and bugs in production and will set a higher bar for infrastructure quality."},{"index":15,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1694100\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nAt Microsoft, we’re on a mission to empower every person and every organization on the planet to achieve more. As the Azure CXP (Customer Experience Program)  team, our mission is to transform Microsoft Cloud customers into fans. Through our deep engineering engagements with customers and teams across Microsoft, we analyze and amplify customer needs and drive the vision to improve Cloud quality, security, and reliability. Our growth mindset and culture of inclusion are central to who we are and how we work. Every day, our customers stake their business and reputation on our cloud. You can help us provide our customers with the world-class cloud services they need to succeed. \n The focus of our Azure CXP (Customer Experience Program) Engineering is to build extensible platforms, connected customer experiences (CX), enable digital transformation, and improve customer outcomes. Our top-level objectives include winning customer satisfaction by providing the help they need and reducing customer challenges. Our team believes in living the core Microsoft values of Respect, Integrity and Accountability. \n We are looking for a Software Engineer II with a passion for delivering well-designed, scalable, and reliable software for large-scale projects. As part of this role, you will collaborate closely with multiple teams to deliver key customer solutions and the technology to support them. \n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.","qualifications":"Qualifications\nRequired\/Minimum Qualifications \n·        Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. \n Other Requirements\n Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\nThis position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter.\nPreferred Qualifications \nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python \nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n·        Experience designing, implementing, and shipping high scale distributed web services using C# or Java \n·        Expertise in one or more web application dev frameworks like Angular, React, Redux, etc. \n·        Experience with distributed systems and a cloud technology stack such as Azure or AWS \n·         A good working knowledge of agile software development methodologies and tools that enable these, such as GitHub, Azure DevOps, etc. \n·        Proficiency in computer science concepts including data structures, algorithms, and software design patterns. \n  Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  ","responsibilities":"Responsibilities\n ·                  Design, implement, verify, deploy, and maintain high-quality code using modern engineering practices and tools. \n·                  Produce extensible and maintainable designs and code. \n·                  Optimize, debug, and refactor code to improve performance and maintainability, and effectiveness. \n·                  Contribute to the continuous improvement of the team's processes, practices, and culture. \n·                  Learn and adopt new technologies and frameworks as needed. \n You will be a meaningful part of a team that values diversity of thought and recognizes everyone for their personal strengths and desire to learn and grow. \n Embody our culture and values\n "},{"index":16,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1698789\/Software-Engineer","error":false,"error_msg":"","overview":"Overview\nDo you have a passion for building scalable and reliable services that power world-class product experiences? If so, you might be the Software Engineer we are looking for. At Microsoft, our mission is to enable every person and every organization on the planet to achieve more. We foster a culture of growth mindset, excellence, and teamwork that inspires us to create life-changing innovations that impact billions of lives around the world. You can be part of our mission and join our diverse and talented team. To learn more, please visit: https:\/\/careers.microsoft.com\/mission-culture.\n At Microsoft, we treasure those who offer unique viewpoints to our products. Here, developers do more than just code; they significantly influence our product’s trajectory and feature set. We’re cultivating a team that holds diversity in ideas and backgrounds in the same regard as technical expertise. A place where innovation is welcomed, and all are motivated to propose new concepts that enhance our customers’ experiences. Your contributions will not only shape our products but also improve the lives of our customers. Come join us and make an impact.\n By applying to this position, you are being considered for multiple like positions within our organization for an invitation-only virtual Interview Day. Position specifics, including hiring team, location, and position details will be determined following the interview process. ","qualifications":"Qualifications\nRequired\/Minimum Qualifications\nBachelor's Degree in Computer Science or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience\n Other Requirements:\n Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:   \n Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire\/transfer and every two years thereafter.  \n  Additional or Preferred Qualifications\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n  Software Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year.\nThere is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.\n Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year.\nThere is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  ","responsibilities":"Responsibilities\nIn this role, you’ll dive into a wide array of technology layers, tackling tasks that range from crafting user-centric interfaces to engineering robust cloud services. You’ll navigate the realms of big data and machine learning, among others. As you design globally scalable services and experiences, you’ll gain invaluable insights. Collaborating with fellow team members and various engineering divisions within Microsoft, you’ll develop comprehensive web applications and services, leveraging cutting-edge web technologies in a vibrant, agile setting. Join a team that’s passionate about overcoming challenges, fervent about learning, and committed to collaboration. Embrace opportunities for mentorship, professional advancement, and making a significant impact on key business objectives.\n Other: \nEmbody our culture and values "},{"index":17,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1695154\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nHave you ever imagined a world with an infinite amount of storage available and accessible to everyone? A place where everyone in the world can easily access their data from anywhere at any time via any means (e.g., mobile phones, tablets, PCs, smart devices, etc.). Did you ever desire a universally accessible storage system to record all the knowledge known to mankind or to store all the data collected from all the scientists in the world for them to collaborate upon? Do you want to be part of a team that strives to bring these to reality?\nIf so, the Microsoft Azure Storage team is what you are looking for. We are building Microsoft’s cloud storage solution - Microsoft Azure Storage, which is a massively scalable, highly distributed, ubiquitously accessible storage system, designed to scale out and serve the entire world. We continue to have tremendous hockey stick growth, we have many Exabyte’s of data stored, and are designing and building systems for Zettabyte scale to support demand growth for the coming years.\nAs a Software Engineer II  you will build, improve and support highly scalable, performant services that deliver highly reliable, secure and available access to storage for our customers. You will face challenges of monitoring, analyzing, and designing for ever-growing data needs of our customers and for ensuring data privacy, protection and compliance. This opportunity will allow you to develop your technical skills in cloud services and storage, accelerate career growth, and provide an opportunity to work in a highly dynamic, flexible, and globally distributed team.\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n2+ years of experiences with cloud computing platforms, or any distributed systems.\n2+ years of experiences with .NET, C#, Java, Python or other programming languages.\n2+ years of experiences with any NoSQL database, such as MongoDB, Cassandra, Redis, etc.\n Other Requirements:\nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire\/transfer and every two years thereafter.\n Preferred Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nExperience with RESTful APIs, microservices, distributed systems, and data structures and experience with agile methodologies and software development lifecycle.\nKnowledge of software design principles, patterns, and best practices.\nExcellent communication, collaboration, and problem-solving skills.\nAbility to work independently and as part of a team.\n Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n   #azurecorejobs","responsibilities":"Responsibilities\nDesign and implement new features and enhancements for Azure Storage services to enable new hardware designs using best practices and industry standards.\nDebug and troubleshoot complex issues across multiple software components that block us from enabling new Hardware technologies.\nAnalyze large scale performance measurement data to find bottlenecks in the software or hardware.\nOptimize and improve the performance, scalability, reliability, and security of the software.\nCollaborate with other engineers, product managers, and customers to gather requirements, provide feedback, and deliver solutions.\nLead and mentor junior engineers and provide technical guidance and direction.\nConduct code reviews and ensure adherence to coding standards and quality criteria.\nResearch and evaluate new technologies and frameworks to improve the software.\nDocument and communicate the design and architecture of the software."},{"index":18,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1699625\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nMicrosoft bets on Artificial Intelligence (AI) as the next growth opportunity for the company. OpenAI, Mistral, and other Large language Model (LLM) driven innovations are happening throughout the industry. Azure AI is focused on building a platform that makes it easy for both first party Microsoft teams and third party customers to build cutting edge applications on top of these large language models. We are going through \"product experiences\" revamp to meet the demand that’s created by LLM’s, and we are in the forefront introducing new sets of capabilities that are vital to making consumptions of LLM’s for production use while meeting enterprises security, isolation, and compliance requirements.\n We are looking to hire a Software Engineer II to join our Azure Machine Learning (AzureML) Experiences Team. In this role, you will be working with a group of engineers who are currently working on new software development kit (SDK) experiences that make it easier for our customers to consume LLM’s for their production use, and you will be working on the services that power those SDKs. These services also power Azure AI Studio. We are looking for a motivated, results-oriented, and collaborative Software Engineer II who has a drive for results.\n You will also participate in proposing and developing innovative solutions that span across multiple layers of technologies. You will be responsible for fully understanding requirements and providing solutions that match the needs.\n As a team, we adopt a culture of meritocracy, bias towards taking big risks and failing fast, and value hacking together. You will join a team of talented engineers who love solving hard problems, embrace open source.\n If you are a service developer who is passionate about making AI accessible and solving world problems, you should join us.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.","qualifications":"Qualifications\nRequired\/Minimum Qualifications:  \nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to C#, Java, or Python\nOR equivalent experience.\n1+ years of experience with distributed systems design and implementation, especially microservice architecture, and experience with cluster scheduling technologies like Kubernetes\n Other Requirements:\nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter.\n Preferred\/Additional Qualifications: \nBachelor's Degree in Computer Science or related technical field AND 3+ years technical engineering experience with coding in languages including, but not limited to C#, Java, or Python\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to C#, Java, or Python\nOR equivalent experience.\nUnderstanding of Azure is a plus\n Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  #aiplatform","responsibilities":"Responsibilities\nDetermine user requirements, create test plans, identify dependencies, estimate work, schedule deliverables.\nApply good coding standards and patterns.\nPerform software development in C#, Python, and other languages. \nEmbody our Culture and Values"},{"index":19,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1699625\/Software-Engineer-II","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":20,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1696644\/Software-Engineer","error":false,"error_msg":"","overview":"Overview\nThe Azure Networking team is looking for a Software Engineer who is interested in building the world’s most reliable cloud. We are redefining the nature of software in the network by writing the software that runs on the switches and building massive distributed systems to control Microsoft’s Cloud Datacenters.\n\nIf you are interested in working in a start-up like environment, passionate about cloud computing technology, and building the next billion-dollar business, then look no further than the Azure Networking Team. Azure provides developers with on-demand compute and storage to create, host, scale, and manage scalable web application on the Internet through Microsoft’s global data centers, and via on-premises private cloud deployments of the Azure Platform.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired Qualifications:\nBachelor's Degree in Computer Science, or related technical discipline with experience coding in languages including, but not limited to, C, C++, C#, or Python\nOR equivalent experience.\nOther Requirements:\n Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire\/transfer and every two years thereafter.\n Preferred Qualifications:\nKnowledge of IP routing related protocols\nKnowledge of Linux kernel networking\nKnowledge of hardware architecture or device drivers\nKnowledge of data modelling or network management protocols\n Software Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n   #azurecorejobs","responsibilities":"Responsibilities\nDesign and develop features and solutions.\nFix software bugs and refactor code as needed.\nDevelop and automate software unit and system testing for all code to ensure quality.\nProvide support and resolve issues for the Azure production network.\nOther\nEmbody our Culture and Values"},{"index":21,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1698328\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nDo you have a passion for engineering and a talent for solving complex problems? Do you want to work on the Operating System (OS) platform that powers Azure? The Core Operating System (OS) team is seeking a talented Software Engineer II who can handle live site operations and ensure the smooth running of the Operating System (OS) underlying the Azure platform. The team is responsible for ensuring the reliability and performance of the Operating System (OS) platform that supports core services and virtual machines in Azure. As a member of this team, you will have the opportunity to design and implement solutions that improve the Operating System (OS) platform and deliver value to our customers.\n In Core OS, we are responsible for the Operating Systems that power Azure, Microsoft's Linux Operating System (OS), the platforms for Windows Client and Xbox, and our Windows Server ecosystem – through all of these, we support every one of our cloud businesses and billions of customers around the world. In this era of ubiquitous computing, systems software excellence has never been more important for Microsoft. High quality, high-efficiency operating systems and platform components underpin everything we do as a company, from making our systems more reliable for our customers, to increasing our competitiveness by reducing Cost of Goods Sold (COGS), to delivering new features and capabilities to delight customers – that’s all us! \n To deliver on our vision, we are looking for a talented engineer with the passion to learn and dive deep in new technical areas. You will be able to identify key areas to focus engineering efforts to maximize return, solve the problems impacting our platform experience, and drive solutions to improve future platform operations.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. ","qualifications":"Qualifications\nRequired Qualifications\n Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nRortation in a live site operations team with a 25% load of on-call duties (split between a primary and a back up role) supporting Redmond daytime hours, 8AM-9PM PST\n2+ years of experience in building and shipping production grade software or services\n1+ years of experience supporting production systems in a live site model\nPreferred Qualifications\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience\nExperience leading technical projects end-to-end.\nEffective written and verbal communication skills.\nExperience working with distributed systems in a cloud environment.\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  #CoreOSJobs #AEPJobs","responsibilities":"Responsibilities\nDesign and develop new automation solutions for incident analysis and hands-off mitigation.\nCollect and analyze data on various metrics to identify key areas to invest engineering opportunities.\nInvestigate, diagnose, and mitigate key issues impacting the Operating System (OS) platform.\nRotation in a live site operations team with a 25% load of on-call duties (split between a primary and backup role) supporting Redmond daytime hours, 8AM-9PM PST\nShifting rotation will occasionally have weekend on-call requirements but will be offset with weekday time off."},{"index":22,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1697923\/Software-Engineer","error":false,"error_msg":"","overview":"Overview\nMicrosoft Defender for Endpoint Team is growing fast and looking for new talent. We are committed to defending Microsoft customers from cyber-attacks as well as providing sophisticated tooling for securing important data. Our team fosters an agile development environment, continuously gathering and analyzing data to combat evolving threats. Our mission is to help protect customers with truly innovative proactive protection, advise customers on emerging trends, and engage in valuable partnerships.  \n  We strive to stay one step ahead of malicious adversaries and predict the threats of the future. We work with partners across Microsoft to innovate new approaches for detecting and tracking threats, attacker techniques, their tools and infrastructure. We build distributed systems and large-scale cloud service working together as a cross-functional team of Software Engineers, Program Managers, Data Scientists and Security Researchers.   \n   Our cloud services leverage Big Data and employ the latest advancements in AI and Machine Learning (ML) for cyber security. Key product lines built by our team include the world’s leading Anti-Virus, the Microsoft Defender which is included as part of Windows and Microsoft Defender for Endpoint (MDE) for enterprise customers. Our products and services are foundational drivers for Microsoft 365 and are a major growth opportunity for Microsoft. \n  Making our customers succeed with our solutions is what excites us every day! Our team has people from a wide variety of backgrounds, previous work history, and life experiences, and we are eager to maintain and grow that diversity. Our diversity of backgrounds and experiences enables us to create innovative solutions for our customers, while having a blast working together on building those systems. We are passionate about learning on the job. Our culture is collaborative, and customer focused.  \n We are looking for a Software Engineer with problem-solving skills who loves to learn, grow and be a valuable contributor to the team, as well as someone who delivers top quality work with innovative ideas in our security spaces. \n We are on a mission to enable endpoint protection to every person and organization on the planet.  We are looking for a Software Engineer to help us design and build services and tools to bring cutting-edge cyber security solutions to our enterprise customers to manage and protect devices against cyber threats. The Software Engineer will build engineering solutions to accelerate product delivery to global markets. You will be working with other Software Engineers and Software Architects across the globe in an inclusive and collaborative environment. ","qualifications":"Qualifications\nRequired\/Minimum Qualifications:\nBachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nExperience as a software engineer shipping commercial software products & services. \nExperience in cloud development principles and patterns, including but not limited to the following: loosely coupled architectures, micro-services, and dev-ops model.\nOther Requirements:\nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter \n Preferred Qualifications:   \nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nCommunication skills and ability to collaborate in a multi-disciplinary team consisting of Software Engineers, Program Managers, Security researchers, and Data Scientists \nExperience building distributed services.  \nDeliver software into services using Continuous Integration, Continuous Deployment methodology. \nExperience in test automation tools.\nDesign REST based APIs that can be accessed securely from web and client applications.  \nFamiliar with Secure Software Development Life Cycle.  \nExperience with software development tools such as source control systems (GIT), automated build systems, compilers, software validation systems, project tracking, and lifecycle management systems. \nDevelopment experience with cloud platforms such as Microsoft Azure and AWS. \n Software Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year.\nThere is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.\n Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year.\nThere is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n   #MDEeng\n#scjobs \n#MSFTSecurity","responsibilities":"Responsibilities\nDesign, implement, test, and deliver with provable quality solutions that are distributed, high scale, high availability, geo-redundant, low maintenance, and high value. \nAdhere to modern engineering practices, effective coding, writing unit test cases, debugging, code reviewing and creating CI\/CD (Continuous Integration\/Continuous Delivery) pipelines. \nConduct testing and code reviews to ensure quality code is released to production systems. \nWork across geographic and organizational boundaries to define requirements, scope work, develop features, integrate functionality, and meet key performance goals. \nOwn and drive projects with large scope and complicated features by working toward self-defined goals and milestones. \nDeliver on engineering commitments, while keeping customer experience and satisfaction as the overarching goal \nBuild functional and technical documentation. \nIdentify and triage bugs, develop fixes to code defects. "},{"index":23,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1697912\/Software-Engineer","error":false,"error_msg":"","overview":"Overview\nMicrosoft 365 (M365) Intelligent Conversation and Communications Cloud is the platform that powers billions of real-time customer conversations across Microsoft’s first-party (Teams, Skype), second-party (Dynamics), and third-party solutions (through Azure Communication Services). The platform enables reliable and high-quality messaging, meeting, and audio\/video calling services that work every time, from anywhere, seamlessly across all customer touchpoints. Conversations on our platforms are made more intelligent in real-time, empowering best-in-class productivity tools for the modern workplace where every call, meeting, or chat will make the next one better.    \n We are the team behind all the messaging scenarios across multiple products, and develop one of the largest scale, business-critical distributed systems in Microsoft. Our services run in 25+ regions, and we process billions of messages a day, enabling hundreds of millions of active enterprise as well as consumer users. The micro services are highly scalable, highly available, and extremely performant in geo-redundant, multi-tenant systems and honor data sovereignty, privacy, security, and compliance. You will have an opportunity to work with a highly collaborative and fun team in a fast-learning environment. \n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n1+ years of experience with designing, developing and operating of backend services.  \nPreferred Qualifications:\n4+ years designing, developing, and operating backend services.  \nAbility to communicate technical details clearly across organizational boundaries.  \nExperience in DevOps to maintain live services and\\or application frameworks.  \nCloud and services experience, with Azure cloud experience highly desirable.  \nExperience with systematic and structured approach to software design.  \nPassion for building highly scalable, highly reliable services.  \nExperience with or exposure to Agile and iterative development processes.  \nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n Software Engineering IC4 - The typical base pay range for this role across the U.S. is USD $112,000 - $218,400 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $145,800 - $238,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n ","responsibilities":"Responsibilities\nAs a Software Engineer of our mission-focused, multi-disciplinary team, you will:    \nDesign, develop and operate features for large scale distributed software services and solutions. \nAdhere to modern software engineering practices through design and code reviews. \nSystem design through well-defined interfaces across multiple components, code reviews, leveraging data\/telemetry to make decisions.  \nDevelop “best-in-class” engineering for our services by ensuring that the services and the components are well-defined and modularized, secure, reliable, diagnosable, actively monitored and reusable. \nWrite clean and optimized code, improve test coverage for services, organize and implement integration tests, and resolve problem areas.  \nConsider testability, portability\/monitoring, reliability, and maintainability, and understand when code is ready to be shared and delivered. \nGain a working understanding of Microsoft as a business and collaborate with mentors and leaders in order to contribute to cohesive, end-to-end experiences for our users.  \nFocus on customer\/partner needs through a data driven approach. \n Embody our culture and values. "},{"index":24,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1702763\/Software-Engineer---Silver-Team---AI-Enablement---CTJ---Poly","error":false,"error_msg":"","overview":"Overview\nBe a part of the AI revolution! AI is changing the business landscape and Microsoft has emerged as a leading innovator in this field. Microsoft has an exciting opportunity for a Software Engineer in the Cloud+AI Silver Team. The AI Enablement team is focused on building, deploying and operating Azure Open Artificial Intelligence (AOAI) in the Air Gapped Clouds. In this role as a Software Engineer working on AI Enablement, you will be working on the cutting edge and supporting some of our most important customers.\n    Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. ","qualifications":"Qualifications\nRequired\/Minimum Qualifications:\nBachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nProven experience in developing and operating AI LLM frameworks\nOther Requirements:\nSecurity Clearance Requirements: Candidates must be able to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:   \nThe successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and\/or customer screening requirements may result in employment action up to and including termination.\nClearance Verification: This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment.\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter.\nCitizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and\/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance\nPreferred\/Additional Qualifications:\nExperience developing IaaS \/ PaaS services for a Cloud Platform\n1+ years of experience in software development for cloud \/ enterprise \/ server applications.\nExperience developing applications hosted on top of Azure, AWS or other similar Cloud Platforms\nExperience building scalable and high-available services in Cloud\nDemonstrated Computer Science fundamentals, fluent in multi-threaded, asynchronous programming, effective inclination for architecting at scale\nExperience with Python, C#, and Rust\nExcellent technical design, problem solving and debugging skills\nSoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n Microsoft will accept applications for the role until March 31, 2024.\n ","responsibilities":"Responsibilities\nThe scale of our operations is enormous. Microsoft's products and services are overwhelmingly consumed online, and billions of people use them every day. We need people who enjoy analyzing complicated problems, coming up with creative solutions, working in focused teams to build things no-one has thought of before, all in the service of production reliability.   \n Build and support scalable systems and services that enable Large Language models (LLM), such as Azure Open AI, to be operationalized by our customers.\nAssist in automating the deployment mechanisms of supporting systems such that new region\/cloud buildout is touchless. \nWork directly with major customers in the industry to both diagnose and provide solutions for their technical AI scenarios.\nActs as a Designated Responsible Individual (DRI) working on call to monitor service for degradation, downtime, or interruptions. Alerts stakeholders as to the status and gains approval to restore system\/product\/service for simple problems. Responds within Service Level Agreement (SLA) timeframe. Escalates issues to appropriate owners.\nContributes to efforts to collect, classify, and analyze data with little oversight on a range of metrics (e.g., health of the system, where bugs might be occurring). Contributes to the refinement of product features by escalating findings from analyses to inform decisions regarding the engineering of products.\nContributes to the development of automation within production and deployment of a complex product feature. Runs code in simulated, or other non-production environments to confirm functionality and error-free runtime for products with little to no oversight.\nContributes to efforts to ensure the correct processes are followed to achieve a high degree of security, privacy, safety, and accessibility. Checks for visible evidence to demonstrate compliance for product areas. Develops and holds an understanding of the implications of onboarding new technologies following expectations of compliance at Microsoft.\nRemains current in skills by investing time and effort into staying abreast of current developments that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale.\nApplies best practices to reliably build code that is based on well-established methods. Follows best practices for product development and scaling to customer requirements and applies best practices for meeting scaling needs and performance expectations.\nMaintains communication with key partners across the Microsoft ecosystem of engineers. Considers partners across teams and their end goals for products to drive and achieve desirable user experiences and fitting the dynamic needs of partners\/customers through product development.\nMaintains operations of live service as issues arise on a rotational, on-call basis. Implements solutions and mitigations to more complex issues impacting performance or functionality of Live Site service and escalates as necessary. Reviews and writes issues postmortem and shares insights with the team.\nDrives efforts to integrate instrumentation for gathering telemetry data on system behavior such as performance, reliability, availability, usage, and safety mechanisms. Drives sustaining feedback loops from telemetry resulting in subsequent designs. Creates outputs of telemetry such as notifications or dashboards.\nDrives efforts to collect, classify, and analyze data on a range of metrics (e.g., health of the system, where bugs might be occurring). Drives the refinement of products through data analytics and makes informed decisions in engineering products through data integration.\nBuilds, enhances, reuses, contributes to, and identifies new software developer tools to support other programs and applications to create, debug, and maintain code for products. Uses open source when possible. Begins to develop skills in other tools outside areas of expertise. Identifies internal tools and creates tools that will be useful for creating the product, determining if methods are still applicable for the current solution. Shares best practices and teaches others about new tools and strategies.\nDefines and develops standardized, repeatable, scalable solutions to guarantee quality.\nEmbody our culture and values"},{"index":25,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1693741\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nMicrosoft Azure Edge + Platform (E+P) is a globally distributed team of engineers, architects, program managers, product managers, business program managers, business administrators, user experience researchers and designers who are responsible for the platform for Microsoft and for delivering Microsoft’s edge vision. Our team is searching for a Software Engineer II to help create the most reliable and trustworthy OS and platform services to empower Microsoft and our customers to achieve more. We unlock the next wave of opportunity at the edge through an at-scale ecosystem driving widespread adoption of our Microsoft cloud services.\n Are you passionate about security and looking to have impact at scale? The Windows Security team is responsible for making it easy for the 1.5 billion Windows customers to remain secure and stay ahead of ever-evolving threats. Our team delivers the isolation platform that enables users and their code to run at least privilege and the privacy platform that empowers users to make informed choices about their privacy. We would love to have you join our team on this mission.","qualifications":"Qualifications\nRequired Qualifications\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\no OR equivalent experience.\n Preferred Qualifications\nProblem solving and technical skills.\nExperience working with teams to ship large scale software products.\nFocus on customers, learning and inclusion.\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n #AEPJobs \n#ENSJobs\n Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: US corporate pay information | Microsoft Careers\n ","responsibilities":"Responsibilities\nResponsibilities\nDesign, develop, deploy, and debug security and privacy features in the operating system.\nCollaborate with feature and partner teams to deliver these features.\nOther: Embody our Culture and Values "},{"index":26,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1694000\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nOur team is looking to hire a Software Engineer II. The Azure Active Directory (Azure AD) is at the center of Microsoft’s cloud strategy. We build and operate critical authentication, authorization and directory services that are used by the millions of Azure, Office 365, XBOX and Windows users worldwide. In the mobile-first cloud-first world, sign-in and sign-up is the front door for reliable end user experience to use any of Microsoft cloud services. \n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired\/Minimum Qualifications\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nOther Requirements:\nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire\/transfer and every two years thereafter\nAdditional or Preferred Qualifications\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  #MSFTSecurity ","responsibilities":"Responsibilities\n Build and evolve a hyper-scale distributed service. \nParticipate in all stages of product design and development lifecycle. \nDive deep into global-scale service issues and drive improvements to resiliency, latency, and product reliability. \nImprovements in the quality and stability of service fundamentals and promote engineering best practices. \nDemonstrate customer empathy, curiosity and willingness to question and learn, and participation in live site on-call rotation. "},{"index":27,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1697957\/Research-Software-Engineer","error":false,"error_msg":"","overview":"Overview\nMicrosoft Research (MSR) is seeking applications for the position of Research Software Engineer - GenAI to join their team in Redmond, WA. \n At Microsoft Research (MSR), our researchers and engineers pursue innovation in a range of scientific and technical disciplines to help solve complex challenges in diverse fields, including computing, healthcare, economics, and the environment.  \n We are seeking an engineer to join our team and contribute to the advancement of generative AI agent framework. As a software engineer, you will play a crucial role in community building, governing technical direction, and address agile development needs of an open-source project AutoGen. Your work will have a significant impact on the research and development of next-generation AI-agent applications powered by large language models and foundation models. \n MSR offers a vibrant environment for cutting-edge, multidisciplinary, research, including access to diverse, real-world problems and data, opportunities for experimentation and real-world impact, an open publication policy, and close links to top academic institutions around the world.  ","qualifications":"Qualifications\nRequired Qualifications: \nBachelor's Degree in Computer Science, or related technical discipline AND 2+ years technical engineering experience with coding in Python. \nOR equivalent experience. \n1+ years of experience working with collaboration tools like git. \n \nAdditional Qualification add value: \nFamiliarity with large language models (LLMs) \nContributions to open-source projects  \nFamiliarity with AI frameworks such as PyTorch \nFamiliarity with JavaScript, C#, C++, Java, C \nFamiliarity in Cloud stacks and architecture, such as Azure \nExcellent communication skills and the desire to collaborate in a multi-disciplinary team \nDeep understanding of computing systems \n Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n ","responsibilities":"Responsibilities\nResponsibilities include: \nSupports AutoGen, related teams and community in code reviews, issue triage, discuss on Discord and other community engagement channels. \nGrow the community of users and developers of AutoGen. \nIncrease the adoption of AutoGen in products and research. \nImprove the usability and user experience by building intuitive interfaces and integrating with the ecosystem. \nUnderstand user requirements and help with the project plans. \nLearn emerging technology trends and science breakthroughs in generative AI and agents, and inform important technical directions. "},{"index":28,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1695994\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nSecurity represents the most critical priorities for our customers in a world awash in digital threats, regulatory scrutiny, and estate complexity. Microsoft Security aspires to make the world a safer place for all. We want to reshape security and empower every user, customer, and developer with a security cloud that protects them with end to end, simplified solutions. The Microsoft Security organization accelerates Microsoft’s mission and bold ambitions to ensure that our company and industry is securing digital technology platforms, devices, and clouds in our customers’ heterogeneous environments, as well as ensuring the security of our own internal estate. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life-changing innovations that impact billions of lives around the world.\n\nWe're hiring a Software Engineer II for our Secrets Management and Public Key Infrastructure (PKI) team at Secrets Analytics Service, a leading data platform analyzing certificates and secrets across Azure and Microsoft. This pivotal role involves building and enhancing our data platform to serve a wide range of internal and external customers, collaborating with inclusive teams across Identity, Azure, Office, Dynamics, and Xbox to deliver secure data experiences.  Candidates should have a background in software development, data analyze, knowledge of security principles. Join us in creating cutting-edge solutions with an Assume Breach mindset to protect against sophisticated threats, improving visibility and security for the data.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired Qualifications:\n Bachelor's Degree in Computer Science, or related technical discipline AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n                         o OR equivalent experience\n2 years of experience with shipping and operating services at scale.\n\nOther Requirements:\n Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:  \nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter. \nPreferred Qualifications:\nData Analytics experience. \nExperience working with large data sets using SQL\/Azure Data Lake\/Spark to derive actionable insights.\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here:\nhttps:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n\n #MSFTSecurity\n#IdentityJobs","responsibilities":"Responsibilities\nIn this role, you will be responsible for:\nDeveloping data set processes for data modeling, mining, and production\nImplementing internal and external APIs to support data integration and consumption\nEnsuring data privacy and compliance standards are met\nDeveloping and managing data pipelines at enterprise scale\nOptimizing data retrieval, developing dashboards, reports, and visualizations\nFocusing on customer\/partner needs through a data driven approach\nTroubleshooting and optimizing automation, reliability, and monitoring for LiveSite\nOther\nEmbody our Culture and Values"},{"index":29,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1700927\/Cloud-Network-Engineer","error":false,"error_msg":"","overview":"Overview\nMicrosoft Silicon Cloud Hardware Infrastructure Engineering (SCHIE) is the team behind Microsoft’s expanding Cloud Infrastructure and responsible for powering Microsoft’s “Intelligent Cloud” mission. SCHIE delivers the core infrastructure and foundational technologies for Microsoft's over 200 online businesses including Bing, MSN, Office 365, Xbox Live, Skype, OneDrive and the Microsoft Azure platform globally with our server and data center infrastructure, security and compliance, operations, globalization, and manageability solutions. Our focus is on smart growth, high efficiency, and delivering a trusted experience to customers and partners worldwide.\n We are looking for a Cloud Network Engineer professional to join a growing Information Systems and Technology (IS&T) team embedded within Microsoft’s SCHIE engineering team.  The Network Engineer will be part of a dynamic engineering infrastructure team.  This Network Engineer will have primary responsibilities overseeing the network infrastructure connecting our hardware validation labs with cloud services and related engineering systems.  Come and be part of a team which collaborates with silicon engineers to fulfill a unified vision.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. \n ","qualifications":"Qualifications\nRequired Qualifications:\n7+ years technical experience in network design, development, and automation\n OR Bachelor's Degree in Electrical Engineering, Optical Engineering, Computer Science, Engineering, Information Technology, or related field AND 4+ years technical experience in network design, development, and automation.\n OR Master's Degree in Electrical Engineering, Optical Engineering, Computer Science, Information Technology, or related field AND 3+ years technical experience in network design, development, and automation.\n OR Doctorate Degree in Electrical Engineering, Optical Engineering, Computer Science, Information Technology, or related field.\n4+ years of Network Administration experience plus 2+ years of system automation experience using scripting languages such as Shell, PowerShell, Perl, or Python.\n4+ years of experience in systems administration and monitoring.\nOther Requirements:\n Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire\/transfer and every two years thereafter.\nPreferred Qualifications:\nUnderstanding of fundamental statistics.\n1+ year(s) experience delivering network designs into production and experience with live site accountability for a network.\nUnderstanding of engineering concepts.\nCloud Network Engineering IC4 - The typical base pay range for this role across the U.S. is USD $112,000 - $218,400 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $145,800 - $238,600 per year.\n\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay0\n  Microsoft will accept applications for the role until March 31, 2024.\n  #azurehwjobs   #SCHIE   #MILE","responsibilities":"Responsibilities\nNetwork specification, deployment, maintenance, and support.\nTop-level support for network issues.\nReview telemetry for network functions.\nDefine process and policy around network concerns.\nInterface and advise engineering teams on complex network connected hardware deployments.\nInterface and advise other disciplines within IS&T on network concerns.\nEmbody our Culture and Values "},{"index":30,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1669482\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nMicrosoft Azure is building the next generation of network and storage accelerators. We are seeking candidates who love problem solving, designing innovative new architectures, and enjoy thinking outside of the box. Join us as a Software Engineer II to build the world’s fastest public cloud and make a difference to millions of people across the planet.\n\nAs a Software Engineer II in the Azure Host Networking and Hardware Acceleration team, you would be contributing to an industry-leading platform based on technologies like Remote Direct Memory Access (RDMA), Single Root Input Output Virtualization (SRIOV), Field-programmable gate array (FPGA), Windows and Linux. You should have a passion for performant design, test methodologies, and enjoy working on a fast-paced team. \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nOther Qualifications:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire\/transfer and every two years thereafter. \nPreferred Qualifications:\nBachelor's Degree in Computer Science\nOR related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript,\nOR Python\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  #azurecorejobs","responsibilities":"Responsibilities\nWorks with appropriate stakeholders to determine user requirements for a set of features.\nContributes to the identification of dependencies, and the development of design documents for a product area with little oversight.\nCreates and implements code for a product, service, or feature, reusing code as applicable.\nContributes to efforts to break down larger work items into smaller work items and provides estimation.\nActs as a Designated Responsible Individual (DRI) working on-call to monitor system\/product feature\/service for degradation, downtime, or interruptions and gains approval to restore system\/product\/service for simple problems.\nRemains current in skills by investing time and effort into staying abreast of current developments that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale."},{"index":31,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1696900\/Software-Engineer-II---CTJ---Poly","error":false,"error_msg":"","overview":"Overview\nSecurity represents the most critical priorities for our customers in a world awash in digital threats, regulatory scrutiny, and estate complexity. Microsoft Security aspires to make the world a safer place for all. We want to reshape security and empower every user, customer, and developer with a security cloud that protects them with end to end, simplified solutions. The Microsoft Security organization accelerates Microsoft’s mission and bold ambitions to ensure that our company and industry is securing digital technology platforms, devices, and clouds in our customers’ heterogeneous environments, as well as ensuring the security of our own internal estate. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life-changing innovations that impact billions of lives around the world.\n We’re looking for a Software Engineer II who is passionate about building state-of-art services that make Entra a better platform for both developers and customers. As a Software Engineer II on the team, you’ll be able to participate in the whole lifecycle of the service development, including designing, coding, testing and running critical services in production. You’ll have the opportunity to work with a wide variety of people and tackle large scale technical problems which gives you a great opportunity to impact Azure.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired\/Minimum Qualfications:\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nOther Requirements:\nSecurity Clearance Requirements: Candidates must be able to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:  \nThe successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and\/or customer screening requirements may result in employment action up to and including termination.\nClearance Verification: This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment.\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter. \nCitizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and\/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n ","responsibilities":"Responsibilities\nDesign, develop and deliver state-of-the-art services to provide world-class user experiences on Entra\nWork together with the team to ensure service quality, availability and reliability\nParticipate in live-site and customer support to ensure customers using our services have a great experience\nIdentify areas for improvement in existing systems and drive improvements to completion\nWork with independence across multiple partner teams and stakeholders\nEmbody our culture and values"},{"index":32,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1699982\/Cloud-Network-Engineer---II---Poly","error":false,"error_msg":"","overview":"Overview\nMicrosoft Azure’s Silver Hyperscale Networking Team division is designing, building, and operating critical network infrastructure our clients rely on every day, transforming a pile of servers into a connected cloud. We are responsible for ensuring the reliability of these networks, in the face of constant change, relying on cutting-edge research and a stellar engineering team. We have built a large cloud thus far but the best is yet to come as we are continue expanding at a rapid pace. Our division is responsible for a large diversity of technologies and challenges, including software defined networking, software load balancing, physical fiberoptic cables, software managing how to route packets across a global network as fast as possible, DNS, protection against DDoS, and many other challenging problems. We’re looking for engineers and leaders passionate about delivering value to customers in mission critical environments, enjoy a growth hacking culture, and are eager to play one of the most important long games for Microsoft.\n As a Cloud Network Engineer II, you will gather requirements, design solutions, prototype them in a lab environment, pilot them in production, document, and operationalize the chosen solution. You will also develop automation required to enable mass network deployments and managing the overall network configuration. As a cloud network engineer, you are given great independence to manage your projects and engage with the necessary teams to drive it to success in a collaborative and adaptive environment essential for us to scale at cloud speed.\n In Azure Silver Hyperscale, you own features from the design phase through implementation to production. As part of this ownership, you are expected to help support your features by actively participating in an on-call rotation, which includes creating\/updating SOPs (Standard Operating Procedures), Troubleshooting Guides, monitoring systems, mitigating\/restoring network incidents, and deep-dive analysis of root causes of outages.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired\/Minimum Qualifications:\n5+ years technical experience in network design, development, and automation\nOR Bachelor's Degree in Electrical Engineering, Optical Engineering, Computer Science, Engineering, Information Technology, or related field AND 2+ years technical experience in network design, development, and automation.\nOR Master's Degree in Electrical Engineering, Optical Engineering, Computer Science, Information Technology, or related field AND 1+ year(s) technical experience in network design, development, and automation.\nOther Requirements:\nSecurity Clearance Requirements: Candidates must be able to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:  \nThe successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and\/or customer screening requirements may result in employment action up to and including termination.\nClearance Verification: This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment.\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter.\nCitizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and\/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance.\n Preferred\/Additional Qualifications:\nProven experience as a collaborator, attentive listener that is calm under pressure, earns confidence from others and is adaptive. A Cloud Network Engineers' role may span a variety of traditional roles, such as design engineer, deployment engineer, operations engineer and project manager.\nUnderstanding of software architecture with the ability to articulate software requirements to teams of software developers.\nScripting skills (Python, PowerShell and C# are preferred, but not a strict requirement) for automating day-to-day tasks are a plus.\n3+ years Networking Engineering experience working with Layer 2 protocols, Layer 3 networking with IP, as well as routing protocols such as OSPF\/IS-IS, BGP, and MPLS.\nExperience troubleshooting across a variety of networking platforms including, but not limited to, Cisco, Juniper, and Arista\nCloud Network Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  ","responsibilities":"Responsibilities\nYou will work with other teams in Azure Networking, participating in architectural and design reviews, and delivering your components with high quality.\nYou will also have opportunities to collaborate across the broader Azure organization and with external Microsoft customers. There is high visibility in an area of large and expanding investment for Azure, offering a terrific opportunity for technical and career growth.\nIn Azure Networking, you own features from the design phase through implementation to production. As part of this ownership, you are expected to help support your features by actively participating in an on-call rotation, which includes creating\/updating SOPs (Standard Operating Procedures), Troubleshooting Guides, monitoring systems, mitigating\/restoring network incidents, and deep-dive analysis of root causes of outages.\nEmbody our culture and values"},{"index":33,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1691775\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nWe are hiring a Software Engineer II to help us design and build systems and new data privacy products. Engineering Thrive is a cross-company collaboration providing consistent, quantitative, company-wide engineering metrics and supporting business processes to measure and improve Microsoft’s engineering efficiency and satisfaction. We focus on the SPACE (Satisfaction, Performance, Activity, Communication & Collaboration, Efficiency & Flow) productivity framework which tells us that there are several important dimensions to productivity along the axes of SPACE. To learn more about SPACE, please go here: https:\/\/www.microsoft.com\/en-us\/research\/publication\/the-space-of-developer-productivity-theres-more-to-it-than-you-think\/.\n As a Software engineer II in the Thrive Engineering Team, you will join a diverse team that is responsible for collecting and providing raw engineering data across Microsoft. The team will also be responsible for supporting data analysts and metric owners to ensure data query quality and performance and ensuring these productivity metrics becoming real time actionable for more than 60,000 Microsoft engineers. This includes query reviews and optimization, orchestrating metric computations, adding them to dashboards visible to presidents around Microsoft as well as building a core platform that will allow data analysts and metric owners to become independent and help reduce the time for metric design and productization. \n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n Other Requirements:\n Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:\nThis position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter.\nAdditional or Preferred Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n2+ years of experience in SQL like languages and with data pipelining and\/or data analytics.\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  DDJL, #1ES","responsibilities":"Responsibilities\n Build and maintain the Thrive Platform, including Metrics definitions and implementation, Experiences\/UI, guidance, driving changes to data collections to support Thrive requirements and working closely with divisional champions that guide changes across Microsoft.\nDevelop metadata\/classification for cohorts and other scenarios, implement new metrics, take feedback, and incorporate into platform, and contribute to platform.\nImplement DORA (DevOps Research and Assessment) metrics specification, DORA metrics implementation, and drive source system instrumentation for DORA metrics.\nEnsure that metrics have broad reach within Microsoft and can be easily onboard, and that leaders can self-serve and act on the metrics via UI and queries.\nDashboards and UI, provide guidance and tooling marketplace, and maintain a case studies library.\nEnsure that signals move to quarterly cadence, maintain high response rates, make NSAT (net satisfaction) data available in UI, and classify verbatims with high quality.\nDevelop various data pipelines between existing data stores to combine data to enable high performance, cross-tore queries.\nParticipate in 24\/7 on-call rotation to support 1st party customers.\nEmbody our culture and values"},{"index":34,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1699979\/Cloud-Network-Engineer-II---CTJ---Poly","error":false,"error_msg":"","overview":"Overview\nMicrosoft Azure’s Silver Hyperscale Networking Team division is designing, building, and operating critical network infrastructure our clients rely on every day, transforming a pile of servers into a connected cloud. We are responsible for ensuring the reliability of these networks, in the face of constant change, relying on cutting-edge research and a stellar engineering team. We have built a large cloud thus far but the best is yet to come as we are continue expanding at a rapid pace. Our division is responsible for a large diversity of technologies and challenges, including software defined networking, software load balancing, physical fiberoptic cables, software managing how to route packets across a global network as fast as possible, DNS, protection against DDoS, and many other challenging problems. We’re looking for engineers and leaders passionate about delivering value to customers in mission critical environments, enjoy a growth hacking culture, and are eager to play one of the most important long games for Microsoft.\n As a Cloud Network Engineer II, you will gather requirements, design solutions, prototype them in a lab environment, pilot them in production, document, and operationalize the chosen solution. You will also develop automation required to enable mass network deployments and managing the overall network configuration. As a cloud network engineer, you are given great independence to manage your projects and engage with the necessary teams to drive it to success in a collaborative and adaptive environment essential for us to scale at cloud speed.\n In Azure Silver Hyperscale, you own features from the design phase through implementation to production. As part of this ownership, you are expected to help support your features by actively participating in an on-call rotation, which includes creating\/updating SOPs (Standard Operating Procedures), Troubleshooting Guides, monitoring systems, mitigating\/restoring network incidents, and deep-dive analysis of root causes of outages.\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired\/Minimum Qualifications:\n5+ years technical experience in network design, development, and automation\nOR Bachelor's Degree in Electrical Engineering, Optical Engineering, Computer Science, Engineering, Information Technology, or related field AND 2+ years technical experience in network design, development, and automation.\nOR Master's Degree in Electrical Engineering, Optical Engineering, Computer Science, Information Technology, or related field AND 1+ year(s) technical experience in network design, development, and automation.\nOther Requirements:\nSecurity Clearance Requirements: Candidates must be able to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:   \nThe successful candidate must have an active U.S. Government Top Secret Clearance with access to Sensitive Compartmented Information (SCI) based on a Single Scope Background Investigation (SSBI) with Polygraph. Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. Failure to maintain or obtain the appropriate U.S. Government clearance and\/or customer screening requirements may result in employment action up to and including termination.\nClearance Verification: This position requires successful verification of the stated security clearance to meet federal government customer requirements. You will be asked to provide clearance verification information prior to an offer of employment.\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter.  \nCitizenship & Citizenship Verification: This position requires verification of U.S. citizenship due to citizenship-based legal restrictions. Specifically, this position supports United States federal, state, and\/or local United States government agency customer and is subject to certain citizenship-based restrictions where required or permitted by applicable law. To meet this legal requirement, citizenship will be verified via a valid passport, or other approved documents, or verified US government Clearance\nPreferred\/Additional Qualifications:\nProven experience as a collaborator, attentive listener that is calm under pressure, earns confidence from others and is adaptive. A Cloud Network Engineers' role may span a variety of traditional roles, such as design engineer, deployment engineer, operations engineer and project manager.\nUnderstanding of software architecture with the ability to articulate software requirements to teams of software developers.\nScripting skills (Python, PowerShell and C# are preferred, but not a strict requirement) for automating day-to-day tasks are a plus.\n3+ years Networking Engineering experience working with Layer 2 protocols, Layer 3 networking with IP, as well as routing protocols such as OSPF\/IS-IS, BGP, and MPLS.\nExperience troubleshooting across a variety of networking platforms including, but not limited to, Cisco, Juniper, and Arista\nCloud Network Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n   ","responsibilities":"Responsibilities\nYou will work with other teams in Azure Networking, participating in architectural and design reviews, and delivering your components with high quality.\nYou will also have opportunities to collaborate across the broader Azure organization and with external Microsoft customers. There is high visibility in an area of large and expanding investment for Azure, offering a terrific opportunity for technical and career growth.\nIn Azure Networking, you own features from the design phase through implementation to production. As part of this ownership, you are expected to help support your features by actively participating in an on-call rotation, which includes creating\/updating SOPs (Standard Operating Procedures), Troubleshooting Guides, monitoring systems, mitigating\/restoring network incidents, and deep-dive analysis of root causes of outages.\nEmbody our culture and values"},{"index":35,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1680853\/Software-Engineer","error":false,"error_msg":"","overview":"Overview\nThe Artificial Intelligence (AI) Frameworks team at Microsoft develops AI software that enables running AI models everywhere, from the world’s fastest AI supercomputers, to servers, desktops, mobile phones, Internet of Things (IoT) devices, and internet browsers.  We collaborate with our hardware teams and hardware partners to build the software stacks for novel AI accelerators like the Maia 100.  We work closely with Machine Learning (ML) researchers and developers to optimize and scale out model training and inference and we are looking for a Software Engineer to join our team!\n The team operates at the intersection of AI algorithmic innovation, software, systems, and purpose-built AI hardware. We are a cross-discipline team with a collaborative and inclusive culture. We also work with and contribute back to the open-source community. \n As a Software Engineer on our team, you will have the opportunity to work on the fundamental abstractions, programming models, compilers, runtimes, libraries, and Application Programming Interfaces (APIs) that enable large scale training and inferencing of the world’s most advanced AI models on novel AI hardware. \n This is a technical role: it requires hands on software design and development skills. We’re looking for a Software Engineer who has a demonstrated history of solving hard technical problems and is motivated to tackle the hardest problems in building a full end-to-end AI stack.  An entrepreneurial approach and ability to take initiative and move fast are essential. \n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.","qualifications":"Qualifications\nRequired\/Minimum Qualifications:  \n · Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\no OR equivalent experience.\n Other Requirements:\nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter.\n Preferred\/Additional Qualifications: \n1+ years’ experience with Python \nA technical background and solid foundation in software engineering principles and architecture design \nDeep intellectual curiosity and passion about learning new technologies \nExposure to Deep Neural Network training and inference and experience in one or more deep learning frameworks (PyTorch, Tensorflow, ONNX, etc) \nCross-team collaboration skills and the desire to collaborate in a team of researchers and developers\n Software Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n   #aifx \n#AIPLATFORM#\n#AIPLATREF#","responsibilities":"Responsibilities\nApply engineering principles for defining robust and maintainable architecture and designs. \nCollaborate broadly across multiple disciplines from hardware designers to ML developers  \nPerform software development in C\/C++, Python, and other languages.  \nIdentify requirements, scope solutions, estimate work, schedule deliverables. \nOther: Embody our Culture and Values"},{"index":36,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1691377\/Software-Engineer","error":false,"error_msg":"","overview":"Overview\nAre you passionate about building innovative systems at the intersection of HPC (high-performance computing), AI and Quantum?  Do you want to be part of the next revolution in computing?  If so, the Azure Quantum Elements team is looking for you - we are looking to hire a Software Engineer to join our team!\n Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day. ","qualifications":"Qualifications\nRequired\/Minimum Qualifications\nBachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nOther Requirements:\nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: \nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter.\n Additional or Preferred Qualifications\nBachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nPrior experience with Linux – systems administrator and troubleshooting\nFamiliarity with high performance computing solutions in Azure, or other hyperscalers\nPrior experience with DevOps, e., scripting, automation and orchestration using languages\/tools such as bash, ansible, bicep, ARM\nSoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n   #Quantum","responsibilities":"Responsibilities\nUnderstand User Requirements \nContributes in partnership with appropriate stakeholders (e.g., project manager, technical lead) to determine user requirements for a feature. Considers a variety of feedback channels to incorporate insights into future designs or solution fixes. Begins to incorporate appropriate continuous feedback loops measuring customer value, usage patterns, and other actionable metrics of value. \n Design \nLearns and contributes to processes for the architecture of a product\/solution feature and learns to create proposals by testing design hypotheses and helping to refine code plans under the technical leadership of others. Produces code to test hypotheses for technical solutions and assists with technical validation efforts. Helps with and participates in the development of design documents for simple designs or User Stories with oversight, helps to determine the technology that will be leveraged, and how they will interact. Escalates findings from investigations to team members for design decisions. Learns about the implications of security and compliance requirements in systems architecture. \nCollaborates with others to create a clear and articulated plan for testing and assuring quality of solutions. Helps to augment test cases and assures that features have good test coverage. Learns to integrate automation into testing during planning where applicable. \nSupports identification of dependencies, and the development of design documents for a product feature with oversight. Learns and helps to identify other teams and technologies that will be leveraged, how they will interact, and when one's system may provide support to others. Learns about back-end dependencies associated with product, application, service, or platform functionality for product features. Learns about downstream effects of solutions and work provided. \nCoding \nWith guidance, learns to create and implement code for a product, service, or feature reusing code as applicable. Writes and learns to create code that is extensible and maintainable. Learns about and applies diagnosability, reliability, and maintainability, and understands when the code is ready to be shared and delivered. Applies coding patterns and best practices to write code. \nLearns about and applies knowledge of debugging tools, logs, telemetry, and other methods to proactively flags issues before they occur and reactively flag issues as they occur for product features. Learns to conduct retrospective debugging of solutions to identify root causes of problems. \nLearns to review code and helps to review code of others to ensure it meets the team's and Microsoft's quality standards. Participates in code review processes for self-development, gathers feedback, and learns about coding standards and the team's features. Applies coding patterns and best practices. \nImplement \nLearns to review work items to gain knowledge of product features in partnership with appropriate stakeholders (e.g., project managers). Assists and learns about breaking down work items into tasks and provides estimation. Escalates any issues that would cause a delay. \nLearns about and supports deployment to customers following the correct measures to push features out to customers. Learns about and considers the impact of build deployments on both users and other services. Learns about best practices for the deployment of features safely.  \nReliability and Supportability \nLearns about and contributes to operations of live service as issues arise on a rotational, on-call basis. Identifies solutions and mitigations to simple issues impacting performance or functionality of Live Site services and escalates as necessary. \nActs as a Designated Responsible Individual (DRI) in monitoring system\/product feature\/service for degradation, downtime, or interruptions for simple problems, and recommends actions to restore system\/product\/service by following the playbook. Escalates more complex problems to other DRIs as to status. Responds within Service Level Agreement (SLA) timeframe. Escalates issues to appropriate owners. \nLearns to contribute to efforts to integrate instrumentation for gathering telemetry data on system behavior such as performance, reliability, availability, usage, and safety mechanisms. Supports the maintenance of feedback loops from telemetry resulting in subsequent designs. \nLearns to contribute to efforts to collect, classify, and analyze data with some oversight on a range of metrics (e.g., health of the system, where bugs might be occurring). Contributes to the refinement and integration of feedback in product features by escalating findings from analyses to inform decisions regarding the engineering of products. \nEngineering Excellence \nLearns about, shares new ideas, and leverages software developer tools to create, debug, and maintain code for features. Uses internal tools and open source when possible. \nLearns to develop and contribute to automation within production and deployment of a product feature. Runs code in simulated, or other non-production environments to confirm functionality and error-free runtime for products with oversight. \nLearns about and helps to ensure the correct processes are followed to achieve a high degree of security, privacy, safety, and accessibility. Contributes to efforts to check for visible evidence to demonstrate compliance for product features. Develops understanding of the implications of onboarding new technologies following expectations of compliance at Microsoft. \nReviews current developments and proactively seeks new knowledge that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale. \nDevelops knowledge of and learns to apply best practices to reliably build code that is based on well-established methods. Develops an understanding of global and local regulations for technologies and system applications. Learns about customer scaling requirements and application of best practices for meeting scaling needs and performance expectations. \nLearns about and helps to support communication with key partners across the Microsoft ecosystem of engineers. Supports partner teams across Microsoft (e.g., Xbox, Office) and supports projects to drive and achieve desirable user experiences and fitting the dynamic needs of partners\/customers through product development. \nOther \nEmbody our culture and values "},{"index":37,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1670846\/Software-Engineer","error":false,"error_msg":"","overview":"Overview\nThe M365 Security team focuses on access control and protection solutions for Microsoft cloud infrastructure. We are seeking a Software Engineer for our team. In this role, you will be responsible for building and maintaining services responsible for access control for Microsoft's cloud infrastructure. We own the solutions that manage secure and compliant access to the cloud infrastructure for service deployment, troubleshooting and analysis. We contribute directly to Microsoft runs on trust mission protecting customer data and privacy. We build and leverage advanced technologies in access control, authentication, authorization and secret management space. ","qualifications":"Qualifications\nRequired\/Minimum Qualifications\nBachelor's Degree in Computer Science, or related technical discipline with experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nExperience with information security, specifically in engineering and operations.\nExperience with engineering large scale distributed systems.\n Additional or Preferred Qualifications\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nSoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year.\nThere is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.\n Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year.\nThere is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n\n\n\n#accesscontrol\n#MSFTSecurity\n#DSR\n#MSRC","responsibilities":"Responsibilities\nDesign and develop large scale full stack solutions to meet design specifications on time and per plan.\nDevelop code to complete designs and test interfaces that solve classes of problems, enable integration across groups of components, improve reuse, and satisfy business, customer, engineering, and operational requirements.\nAdhere to modern engineering practices, effective coding, writing unit test cases, debugging, code reviewing and creating CI\/CD (Continuous Integration\/Continuous Delivery) pipelines.\nConduct testing and code reviews to ensure quality code is released to production systems.\nBuild functional and technical documentation.\nIdentify and triage bugs, develop fixes to code defects."},{"index":38,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1671140\/Software-Engineer","error":false,"error_msg":"","overview":"Overview\nThe Microsoft Search in Bing Team is looking for a Software Engineer with experience building large scale web services and state of the art web & Chat applications. In this role, you will have the opportunity to collaborate with teams across Microsoft and the world to develop innovative search solutions for Enterprises. \n You will be part of a passionate and growing team who takes pride in their work, and cares about their colleagues. If you are someone who takes ownership of your projects and thrives in a dynamic environment, we would love to consider your application for this role.","qualifications":"Qualifications\nRequired\/Minimum Qualifications\nBachelor's Degree in Computer Science, or related technical discipline with demonstrated experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n Additional or Preferred Qualifications\nBachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field with demonstrated experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\n Software Engineering IC2 - The typical base pay range for this role across the U.S. is USD $76,400 - $151,800 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $100,300 - $165,400 per year.\n Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n ","responsibilities":"Responsibilities\nDesign and develop large-scale distributed software services and solutions in collaboration with teammates.\nTake end-to-end responsibility for the development, quality, testing, and production readiness of the services you build.\nConstantly improve our live site with monitoring and automation\nModularize components for use across Microsoft 365"},{"index":39,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1671140\/Software-Engineer","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":40,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":41,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":42,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":43,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":44,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":45,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":46,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":47,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":48,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":49,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":50,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":51,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":52,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":53,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":54,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":55,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":56,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":57,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":58,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":59,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/search?q=Software%20Engineer%20-principal%20-senior%20python%20-atlanta&lc=United%20States&p=Software%20Engineering&exp=Experienced%20professionals&rt=Individual%20Contributor&et=Full-Time&l=en_us&pg=3&pgSz=20&o=Relevance&flt=true","error":false,"error_msg":"not enough values to unpack (expected 1, got 0)","overview":"","qualifications":"","responsibilities":""},{"index":60,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1681081\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nMicrosoft’s Cloud business is experiencing explosive growth, and the Cloud Supply Chain (CSCP) organization is responsible for enabling the infrastructure underlying this growth. Our mission is to deliver the world’s computer with an industry-leading supply chain. CSCP is responsible for strategic sourcing, customer demand forecasting, capacity planning and management, supply chain planning and execution, capacity provisioning, and decommissioning and dispositioning of datacenter assets worldwide.\nAs a Software Engineer II in the Product Innovation Team, residing within the Capacity Supply Chain & Provisioning's (CSCP) Strategy & Transformation org, you will utilize innovative technologies to build products to enable the world’s largest distributed Supply Chain network.  Through the convergence of innovative tech such as Web3 and AI based technologies and Microsoft best-in-class products, we are bringing together customers, suppliers, and partners, from various industries, to meet core Supply Chain needs and systematically drive operational efficiencies and revenue growth. These products will form the genesis of our product strategy focused on the Supply Chain vertical for which we are incubating a small nimble engineering team.  Our group won the 2021 Gartner Power of Profession Award and the 2023 Treasury & Risk Alexander Hamilton Award thanks to the near real time visibility, accurate financial transactions, and enhanced compliance that the solution enabled. We are growing to serve global customers across industries. This role will have the successful candidate working to deliver a product to address Supply Chain traceability needs to address regulatory requirements from across the world. This is a challenging space that requires leveraging innovative and out-of-the-box thinking.","qualifications":"Qualifications\nRequired Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience. \n1+ year of Azure Service knowledge (Microsoft Entra ID authentication, App Services, Functions, Message Eventing, App Services), Azure DevOps and Relational databases.\nOther Requirements:\nAbility to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: \nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire\/transfer and every two years thereafter.\nPreferred Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nKnowledge of other traceability and serialization solutions or process as an added benefit.\nHands on skills in: Azure Resource Manager (ARM), Terraform, Hardhat common OATH2 EVM compatible Blockchain \/ Solidity development Leadership and adaptability in dynamic environments, with the ability to nurture stakeholder relationships and steer project success.\nProblem-solving acumen for complex integration challenges, a commitment to quality, and a continuous learning mindset with Azure DevOps experience.\nA successful candidate should also demonstrate at least two projects showcasing proactive identification of problems, bottlenecks with proposed solutions and how this was taken over the finish line.\nGreat additional qualities would be exposure to two projects showcasing understanding of the industry trends in web3 like blockchain and\/or AI.\n\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  #cscpjobs","responsibilities":"Responsibilities\nHands-on component design, coding and unit testing.\nWork closely with the product PM’s, product architect and other engineers to turn architectural design into detailed design and code.\nIdentifying dependencies and technical challenges and finding solutions to overcome through attention to detail and clear communication both verbal and written.\nWillingness to learn new technology and function in a constantly evolving startup environment.\nOther\nEmbody our culture and values.\n "},{"index":61,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1681990\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nThe Azure Core New Tech team is looking for motivated engineers to contribute to the New Technology onboarding process: automating the validation, management, and delivery of all hardware to Microsoft datacenters across Azure, Office and Edge Computing products within Microsoft.\nThe Azure Core team works at the boundary of software and hardware. The team develops technology to secure, validate and manage the hardware throughout the lifecycle (bolts to dust). It invests in the growth of all capacity for Microsoft services and is at the forefront of new hardware platforms coming to the cloud, from classical computing to AI platforms to hyper-scale super-computers.\n\nAs a Software Engineer II in Azure Core New Tech team you will be responsible in creating designs, interpreting requirements and delivering the improvements necessary to bring new technology to live. This opportunity will allow you to expand your knowledge of software and hardware by working together across the wide set of Azure teams, learn about the latest hardware and software technologies coming to market and deliver change to Azure’s hardware quality.\nThe team provides a flexible working environment that enables both hands-on opportunity with hardware and remote contributions.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired Qualifications: \nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nOther Requirements:\n Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire\/transfer and every two years thereafter.\n Preferred Qualifications: \nBachelor's Degree in Computer Science\no OR related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, or Java \nOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, or Java\nOR equivalent experience.\nSoftware Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  #azurecorejobs","responsibilities":"Responsibilities\nWorks with appropriate stakeholders to determine user requirements for a set of features.\nDrives identification of dependencies and the development of design documents for a product, application, service, or platform.\nCreates, implements, optimizes, debugs, refactors, and reuses code to establish and improve performance and maintainability, effectiveness, and return on investment (ROI).\nContributes to efforts to break down larger work items into smaller work items and provides estimation.\nActs as a Designated Responsible Individual (DRI) working on-call to monitor system\/product feature\/service for degradation, downtime, or interruptions and gains approval to restore system\/product\/service for simple problems.\nProactively seeks new knowledge and adapts to new trends, technical solutions, and patterns that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale."},{"index":62,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1685348\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nDo you want to work on the Container Platform that powers the Microsoft Flagship product for Containerized applications - The Azure Kubernetes Service (aka AKS)? Containers are the de facto choice for developers that are rapidly embracing microservices and building highly scalable, cloud native applications. Inspired by companies like Netflix, eBay, SoundCloud, and Twitter, developers everywhere are excited by the promise offered by microservices architectures running on serverless infrastructure. Virtualization and Containers are critical and core to the success of this digital transformation. We are at the center of our company’s cloud strategy and powers many critical Windows Server & Azure scenarios.\n The Container Platform DI (Data & Intelligence) team is seeking a highly motivated Software Engineer II to work on automation driving Containers E2E scenarios and Telemetry. As a member of the Container Platform DI team, you will help lead our engineering efforts to build\/enhance existing frameworks and tools to light up new scenarios. You will also be working with large amounts of telemetry, applying aggregation techniques, ML\/AI to bring exciting and actionable insights that would help improve our products.  Accomplishing that will provide many opportunities that span data pipeline creation, data analysis, product-platform-infrastructure coding, and even ML model building as we drive to meet key results which you will help define. Ultimately, you will help lead data engineering efforts across multiple teams to deliver exciting, secure, and reliable new Microsoft technologies to the world.\n We're looking for a passionate, innovative, and versatile Software Engineer II with a growth mindset to ensure components and scenarios are well integrated to a number of operating systems ranging from Windows to Linux. Our challenge lies in providing these technologies with high reliability, high performance, and optimized cost.\n Microsoft is on a mission to empower every person and every organization on the planet to achieve more. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life-changing innovations that impact billions of lives around the world. You can help us achieve our mission.","qualifications":"Qualifications\nRequired qualifications:\nBachelor's Degree in Computer Science, Math, Software Engineering, Computer Engineering , or related field AND 2+ years experience in business analytics, data science, software development, data modeling or data engineering work\nOR Master's Degree in Computer Science, Math, Software Engineering, Computer Engineering or related field AND 1+ year(s) experience in business analytics, data science, software development, or data engineering work\nOR equivalent experience.\n1+ year  with data analysis, data engineering, or data science\nOther Requirements\n Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire\/transfer and every two years thereafter.\n Preferred qualifications:\nBachelor's Degree in Computer Science , Math, Software Engineering, Computer Engineering , or related field AND 5+ years experience in business analytics, data science, software development, data modeling or data engineering work\nOR Master's Degree in Computer Science, Math, Software Engineering, Computer Engineering , or related field AND 3+ years of business analytics, data science, software development, data modeling or data engineering work experience\nOR equivalent experience.\n2+ years of software development with experiences in debugging, coding and problem solving skills.\n2+ years of professional programming in C\/C++\/C#\/Java or any other object-oriented programming language\nExperience with Docker, Kubernetes, Service Fabric or other container technologies\nFamiliarity with Windows Server, Hyper-V and Storage technologies\nCommunication and collaboration skills\nWilling to take on a wide variety of challenges\nExperience with data science is a plus\nAbility to work in fast paced environments\n\nData Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year. Certain roles may be eligible for benefits and other compensation.\n Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n ","responsibilities":"Responsibilities\nAs you take on this role, you will:\nDesign, build\/enhance existing frameworks and tooling that enable us to be a truly lights-out engineering team\nDevelop scenario automation (E2E & other) that will help ship releases with great quality.\nDesign and implement OS telemetry required for your scenarios, ensuring efficient, insightful, and timely data to inform quality views before and after release to customers.\nDesign, build, and maintain data pipelines to extract and transform data that support OS security features, enabling us to deliver experiences that are both secure and great to use.\nDefine and establish the KPIs for the platform - i.e. measures performance, reliability & telemetry related metrics.\nInvestigate, analyze & troubleshoot live site issues to mitigation\/resolution.\nPartner with your peer Program Manager & Dev teams to understand the needs\/asks, translate them into meaningful deliverables.\nLeverage data to identify defects and user experience issues, crafting dashboards, scorecards, and KPIs to inform the team of scenario reach, quality, and functionality.\nFollow all procedures to maintain data compliance with applicable laws and policies, including identifying, classifying, tagging, and documenting privacy and compliance aspects of data.\nStay up to date with tools needed today and help us adopt those needed tomorrow by always learning, experimenting, and sharing technologies, processes, and approaches across our team."},{"index":63,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1680888\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nAre you looking for an opportunity to build software and systems for some of the biggest data centers that exist in the world? The Azure Networking team is responsible for designing and building the software defined network infrastructure that powers millions of servers around the globe for Azure, Bing and other Microsoft cloud services. Azure Networking is at the forefront of Hyperscale Cloud Computing and runs one of the largest datacenter network infrastructures in the world. With the explosion of artificial intelligence (AI), Microsoft has been at the forefront of developing and adopting AI technologies. Meeting the next waves of AI technologies requires new generations of network, and the Azure Networking team is tasked to design and build the next generation of AI networks.\n\nAzure Networking team is looking for a world-class Software Engineer II to help us in building the highest quality software to manage global scale AI networks.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired Qualifications: \nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience\nOther Requirements:\n Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire\/transfer and every two years thereafter\n Preferred Qualifications: \nKnowledge of UNIX or Linux\nFamiliar with test automation tools and scripting languages\nExperience with agile methodology\nProficient communication skills\nExperiences designing or implementing distributive systems & infrustructre services\nExperience with Network protocols \n  Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  #azurecorejobs","responsibilities":"Responsibilities\nWorks with appropriate stakeholders to determine user requirements for a set of features.\nContributes to the identification of dependencies, and the development of design documents for a product area with little oversight.\nCreates and implements code for a product, service, or feature, reusing code as applicable.\nContributes to efforts to break down larger work items into smaller work items and provides estimation.\nActs as a Designated Responsible Individual (DRI) working on-call to monitor system\/product feature\/service for degradation, downtime, or interruptions and gains approval to restore system\/product\/service for simple problems.\nRemains current in skills by investing time and effort into staying abreast of current developments that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale."},{"index":64,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1680890\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nAre you looking for an opportunity to build software and systems for some of the biggest data centers that exist in the world? The Azure Networking team is responsible for designing and building the software defined network infrastructure that powers millions of servers around the globe for Azure, Bing and other Microsoft cloud services. Azure Networking is at the forefront of Hyperscale Cloud Computing and runs one of the largest datacenter network infrastructures in the world. With the explosion of artificial intelligence (AI), Microsoft has been at the forefront of developing and adopting AI technologies. Meeting the next waves of AI technologies requires new generations of network, and the Azure Networking team is tasked to design and build the next generation of AI networks.\n\nAzure Networking team is looking for a world-class Software Engineer II to help us in building the highest quality software to manage global scale AI networks.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.","qualifications":"Qualifications\nRequired Qualifications: \nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience\nOther Requirements:\n Ability to meet Microsoft, customer and\/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\nMicrosoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire\/transfer and every two years thereafter\n Preferred Qualifications: \nKnowledge of UNIX or Linux\nFamiliar with test automation tools and scripting languages\nExperience with agile methodology\nProficient communication skills\nExperiences designing or implementing distributive systems & infrustructre services\nExperience with Network protocols \n Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year.\n Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay\n  #azurecorejobs","responsibilities":"Responsibilities\nWorks with appropriate stakeholders to determine user requirements for a set of features.\nContributes to the identification of dependencies, and the development of design documents for a product area with little oversight.\nCreates and implements code for a product, service, or feature, reusing code as applicable.\nContributes to efforts to break down larger work items into smaller work items and provides estimation.\nActs as a Designated Responsible Individual (DRI) working on-call to monitor system\/product feature\/service for degradation, downtime, or interruptions and gains approval to restore system\/product\/service for simple problems.\nRemains current in skills by investing time and effort into staying abreast of current developments that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale."},{"index":65,"url":"https:\/\/jobs.careers.microsoft.com\/global\/en\/job\/1681346\/Software-Engineer-II","error":false,"error_msg":"","overview":"Overview\nAre you interested in shaping the future of personal computing, with a small and growing team working with a startup mindset? Come join the Windows Incubation team envisioning and building new Web, Cloud streaming, and AI-powered experiences on a range of devices.  \nAs Software Engineer II on the Windows Incubation team, you will build with the latest advances in the Windows platform, OS\/silicon integration, cloud\/client computing, large language models, and web development. You will partner with Product Management and Design to develop ideas to solve customer problems, and prototypes to learn from. Together with your team, you will design and implement innovative solutions to some of the most complex problems. You are open and adaptable, ready to learn and start working with diverse codebases and technologies. You will contribute to engineering systems, testing, and tools to improve the team's efficiency.  \nIf you thrive on solving problems by building, learning and iterating in a collaborative environment, this is the role for you! We offer in-office, remote and partial remote work arrangements to support your preferred work style.   \nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.  ","qualifications":"Qualifications\nRequired Qualifications:\nBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience. \n2 years of experience developing Operating System components OR Windows applications  \n Preferred Qualifications: \nWeb development using TypeScript, HTML, CSS and Web Components  \nIncorporation of Machine Learning algorithms into shipping products  \nOperating system or application virtualization technology  \nHardware acceleration to optimize software performance  \n Software Engineering IC3 - The typical base pay range for this role across the U.S. is USD $94,300 - $182,600 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $120,900 - $198,600 per year. \n Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https:\/\/careers.microsoft.com\/us\/en\/us-corporate-pay \n  #WinIncubation","responsibilities":"Responsibilities\nCollaborates with appropriate stakeholders to determine user requirements for a scenario.   \nDrives identification of dependencies and the development of design documents for a product, application, service, or platform.   \nCreates, implements, optimizes, debugs, refactors, and reuses code to establish and improve usability, performance and maintainability.   \nLeverages subject-matter expertise of product features and partners with appropriate stakeholders to drive a workgroup's project plans, release plans, and work items.   \nProactively seeks new knowledge and adapts to new trends, technical solutions, and patterns that will improve the availability, reliability, efficiency, observability, and performance of products.   \nActs as a Designated Responsible Individual (DRI) and guides other engineers by developing and following the playbook, working on call to monitor system\/product\/service for degradation, downtime, or interruptions, alerting stakeholders about status and initiates actions to restore system\/product\/service for simple and complex problems when appropriate."}]}